{
	"jobs": [
		{
			"id": 952202,
			"url": "https://remotive.io/remote-jobs/software-dev/back-end-developer-pangea-digital-952202",
			"title": "Back End Developer, Pangea Digital",
			"company_name": "Radio Free Europe/Radio Liberty",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-19T14:38:43",
			"candidate_required_location": "Eastern Europe Only",
			"salary": "",
			"description": "<div class=\"col-title col-xs-12 col-md-10 pull-right content-offset\">\n<div class=\"intro\">\n<p><strong>Please quote vacancy number: TEC1928-2101</strong></p>\n</div>\n</div>\n<div class=\"col-lg-12 separator\">\n<div class=\"separator\"> </div>\n<div class=\"separator\"> </div>\n</div>\n<div class=\"wsw\">\n<p><strong>About Our Team</strong><br>We are looking for a backend C# developer. You will be working on extending and maintaining our backend codebase. With a significant re-architecture across all layers of the stack underway, you will join our core product team working on the new CMS application.<br><br><strong>What would you be doing?</strong><br>Help breaking down our legacy system into domain driven microservices using .NET Core as primary technology stack<br>Collaborate with backend and frontend developers, web designers and testers to deliver new features<br>Work cross functionally across internal teams according to assignments from product managers and the team lead<br><br><strong>You have:</strong><br>Strong knowledge of C# and .NET<br>A solid understanding of Web APIs and SQL (preferably on MSSQL SERVER)<br>Work independently with high level objectives and minimal supervision<br>Used agile development such as Scrum or Kanban, preferably within the Atlassian stack (JIRA, Bitbucket, Confluence), ability to use Git<br>Written unit and integration tests for your code and communicated specifications for end to end tests to the QA team<br>Ability to understand and follow software release process<br><br><strong>As extra you will come with experience and skills in:</strong><br>Domain Driven microservices architecture<br>.NET Core<br>.NET MVC / Web Forms<br>GRAPH QL or similar API query language<br>NOSQL DATABASES<br>Familiarity with modern operations and deployment practices and technologies, including Linux OS and Docker</p>\n</div>\n<p><strong>Should you be interested in this position please apply by submitting your CV and a cover letter in English.</strong></p>\n<p> </p>\n<p dir=\"ltr\"><strong>Who we are ...</strong></p>\n<p dir=\"ltr\">Radio Free Europe/Radio Liberty (RFE/RL) is an international news organization headquartered in Prague, Czech Republic and Washington, D.C., with 21 bureaus throughout Russia, Central Asia, Afghanistan, and Central and Eastern Europe. Reporting in 27 languages across 23 countries, RFE/RL is one of the most comprehensive news operations in the world, providing responsibly reported, fact-based news in countries where media freedoms are under threat or banned outright. From Iran and Pakistan to Hungary, Ukraine, and Azerbaijan, RFE/RL journalists give audiences what they can't always get from their own local media: uncensored information and open debate. Reporting via digital, TV, and radio platforms, RFE/RL has a measured weekly reach of 38.1 million people. A private nonprofit, RFE/RL is funded by the U.S. Congress through the U.S. Agency for Global Media. RFE/RL's editorial independence is protected by U.S. law.</p>\n<p dir=\"ltr\"><strong>RFE/RL Standards</strong></p>\n<p dir=\"ltr\">RFE/RL is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. Positions at RFE/RL are considered Public Trust Positions, with appointment contingent upon the positive outcome of a background investigation.</p>\n<p dir=\"ltr\"> </p>\n"
		},
		{
			"id": 669488,
			"url": "https://remotive.io/remote-jobs/software-dev/software-engineer-crawling-reverse-engineering-669488",
			"title": "Software Engineer (Crawling/Reverse Engineering)",
			"company_name": "Argyle",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-19T14:15:29",
			"candidate_required_location": "Europe/South America/South-east Asia",
			"salary": "$40k - $80k",
			"description": "<p><strong>Software Engineer (Crawling/Reverse Engineering) Remote </strong></p>\n<p><strong> </strong></p>\n<p><strong>Europe/South America/Singapore/Taiwan/Thailand/Philippines</strong></p>\n<p><strong>$40k – $80k</strong></p>\n<p><strong> </strong></p>\n<p>Argyle is a remote-first, Series A fast-growing tech startup that has reimagined how we can use employment data.</p>\n<p> </p>\n<p>Renting an apartment, buying a car, refinancing a home, applying for a loan. The first question that they will ask you is, \"how do you earn your money?\" Wouldn’t you think that information foundational to our society would be simple to manage, transfer and control? Well, it’s not!</p>\n<p> </p>\n<p>Argyle provides businesses with a single global access point to employment data. Any company can process work verifications, gain real-time transparency into earnings and view worker profile details.</p>\n<p> </p>\n<p>We are a fun and passionate group of people, all working remotely across 19 different countries and counting. We are now looking for multiple Scanner Engineers (Crawling/Reverse Engineering) to come and join our global team.</p>\n<p> </p>\n<p>You will join a team of exceptionally talented engineers constantly looking for improvements and innovative ways to meet our business needs. Scrappers (we call them Scanners) are at the core of our business. It means you will constantly be fighting and innovating, owning and taking bold decisions.</p>\n<p> </p>\n<p><strong>What will you do?</strong></p>\n<p><strong> </strong></p>\n<ul>\n<li>You will create, own and maintain Scanners</li>\n<li>You will be contributing to general improvements such as shared libraries &amp; frameworks</li>\n<li>You will be closely working and communicating across different teams</li>\n</ul>\n<p> </p>\n<p><strong>Our stack</strong></p>\n<p><strong> </strong></p>\n<p>Python is our main language. Python libraries we use: celery, pydantic, playwright, puppeteer, beautifulSoup, asyncio, httpx, pydash, mypy, pytest, poetry, pyenv, poppler, PdfMiner. We run Docker, Kubernetes, GCP, Github, ArgoCD.</p>\n<p> </p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Experience in development of robust web scrapers</li>\n<li>Reverse engineering knowledge of Android/iOS or JS/WebApps</li>\n<li>Knowledge of bot and captcha bypass mitigation tactics</li>\n<li>Python coding experience preferred</li>\n<li>Big bonus points if you are familiar with Android/iOS device verification frameworks (SafetyNet Attestation/DeviceCheck) and ways to bypass them</li>\n<li>Should be able to think and act fast in a startup environment</li>\n<li>Shouldn't be scared by a bit of chaos and rapid changes</li>\n<li>Taking ownership of your workload and commitments</li>\n<li>We are big fans of not pointing at things but getting them fixed</li>\n</ul>\n<p><strong>Why Argyle?</strong></p>\n<ul>\n<li>Remote first company</li>\n<li>International environment</li>\n<li>Flexible working hours</li>\n<li>Stock Options</li>\n<li>Flexible vacation leave</li>\n<li>$1000 after a month of employment to set up your home office.</li>\n<li>MacBook</li>\n</ul>\n<p> </p>\n<p>Argyle embraces diversity and equal opportunity. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. We believe the more inclusive we are, the better our company will be.</p>\n",
			"company_logo_url": "https://remotive.io/job/669488/logo"
		},
		{
			"id": 951610,
			"url": "https://remotive.io/remote-jobs/software-dev/full-stack-engineer-951610",
			"title": "Full Stack Engineer",
			"company_name": "Remote OK",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-19T10:31:31",
			"candidate_required_location": "Worldwide",
			"salary": "$50k-$200k",
			"description": "<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\"><a href=\"https://remoteok.io\" rel=\"nofollow\">Remote OK</a> is looking to hire a Full Stack Engineer. With that we mean a generalist software engineer focused on product outcomes rather than any specific part of the stack or language. You need to be more frontend focused than a typical programmer, and re-use any API or backend that exists to get the job done.</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">This is a full-time position.</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\"> </span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\"><strong>Responsibilities</strong></span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- keep existing features working (we monitor most pages and API endpoints every minute)</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- fix bugs that might come up (we have live PHP/JS bug tracking)</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- build new features, that means coding the client side part of it (usually plain JS or w/ jQuery, but without fancy frameworks), and the back end side of it (usually plain PHP with SQLite)</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- ship fast and iterate based on customer feedback (right now we deploy CI/CD-style about 50 times per day)</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\"> </span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\"><strong>Impact</strong></span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- you work on sites that get over 1.4 billion requests per year used by over 1 million people per month</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- you learn how to ship fast with a laser focus on building what customers want while learning how to market those new features directly to an audience</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\"> </span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\"><strong>You should be</strong></span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- autonomous and be able to figure things out for yourself, but I might go AWOL for awhile, so you need to make the best choices yourself how to fix something, or how to build a new feature</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- not wanting to do things the proper overengineering way with Kubernetes clusters and Docker and multi layered sharded databases to scale like in BigCo tech enterprise; doing things proper is good but making customer's happy is the #1 priority, quickly made scrappy code can always be refactored later if a feature starts making money, instead of proper code that took a long time to write for a feature that nobody ends up using</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\"> </span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\"><strong>You'll work in a team with</strong></span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- a Site Reliability Engineer, who keeps the sites up</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- a Community Manager, who keeps the Remote OK community safe</span></span></p>\n<p style=\"margin-top: 0.75em; margin-bottom: 0.75em; line-height: 1.5;\"><span style=\"color: #0f1115;\"><span style=\"font-size: 15px;\">- a Customer Service Specialist, who keeps our customers happy</span></span></p>\n<p> </p>\n"
		},
		{
			"id": 951655,
			"url": "https://remotive.io/remote-jobs/software-dev/ruby-on-rails-developer-951655",
			"title": "Ruby on Rails Developer",
			"company_name": "Bearer",
			"category": "Software Development",
			"tags": [],
			"job_type": "",
			"publication_date": "2021-10-19T08:19:52",
			"candidate_required_location": "EMEA Only",
			"salary": "",
			"description": "<div class=\"h1\"><strong>About Bearer</strong></div>\n<p>The software industry moves fast. Larger scale. Endlessly growing teams. Fragmented, dependency-driven services. We're building at unprecedented scale, and we've never collected or exchanged data at this level. Data is valuable, and protecting it is more important than it's ever been.<br><br>Data security and privacy is paramount; data leaks, data breaches and new privacy laws are commonplace and implore all of us to find a solution, today.<br><br>We believe that the best companies will leverage these challenges as a competitive advantage to drive their business, and we're focused on building the #1 data security platform to help them achieve this mission.</p>\n<p>Bearer is <em>backed by the best European VCs (Alven, Point Nine, Partech) 🦄</em></p>\n<div class=\"h2\">Your mission</div>\n<p>We are looking for an experienced Developer with in-depth experience in Ruby on Rails, who will join our team of developers working in a fast-paced environment to deliver world-class software.</p>\n<p>We expect you to have a passion for programming and for writing clean and efficient Ruby code.</p>\n<div class=\"h3\"><strong>Your main responsibilities are:</strong></div>\n<ul>\n<li>Write clean٫ maintainable and efficient code</li>\n<li>Implement features end-to-end using our Design System already in place</li>\n<li>Maintain existing code</li>\n</ul>\n<div class=\"h3\">Requirements</div>\n<ul>\n<li>2-3+ years working in web development with Ruby on Rails</li>\n<li>Good understanding of Relational Databases (e.g. PostgreSQL) and ORM (e.g. Active Record)</li>\n<li>Experience with Design Patterns (Service Objects and Interactors)</li>\n<li>Experience of performance and query optimisation</li>\n<li>Experience in a Product company and in a startup environment\n<ul>\n<li>Understand the tradeoff of shipping value to the end user vs making something perfect</li>\n</ul>\n</li>\n<li>Experience with TDD (RSpec)</li>\n<li>Exceptional learning skills</li>\n<li>Experience with turning Designs into Code</li>\n<li>Exceptional problem solving and ability to work independently</li>\n<li>Professional proficiency in English</li>\n<li>EMEA time zone</li>\n</ul>\n<div class=\"h3\">Nice to have</div>\n<ul>\n<li>Experience building scalable systems with cloud infrastructures like Heroku or AWS.</li>\n<li>Contributions to open source Ruby gem projects</li>\n<li>Experience with Hotwire (<a href=\"%22https://hotwire.dev/%22\" rel=\"nofollow\">https://hotwire.dev</a>)</li>\n</ul>\n<div class=\"h3\">Our Stack</div>\n<ul>\n<li>Ruby on Rails</li>\n<li>Hotwire (Stimulus, Turbo, Turbo Stream)</li>\n<li>ViewComponent</li>\n<li>PostgreSQL</li>\n<li>Sidekiq</li>\n<li>AWS</li>\n<li>Docker / EKS</li>\n<li>GitHub Actions (CI / CD)</li>\n<li>TailwindCSS</li>\n</ul>\n<div class=\"h3\"><strong>Benefits</strong></div>\n<p>As part of the Bearer team, you will also get:</p>\n<ul>\n<li>A competitive compensation package, with a salary ranging from €60k - €80k/year;</li>\n<li>The chance to join a highly skilled team of software engineers;</li>\n<li>The opportunity to have an impact on a fast-growing organization;</li>\n<li>Work from (almost) anywhere.</li>\n</ul>\n<p>Come and build the future of Data Security &amp; Privacy with us!</p>",
			"company_logo_url": "https://remotive.io/job/951655/logo"
		},
		{
			"id": 921789,
			"url": "https://remotive.io/remote-jobs/software-dev/react-developer-921789",
			"title": "React Developer",
			"company_name": "lm group",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-19T05:40:43",
			"candidate_required_location": "Europe Only",
			"salary": "",
			"description": "<p><br><br></p>\n<div class=\"h3\">Company Description</div>\n<p>Launched in 1998, this pioneering British-born brand has specialised in creating amazing experiences and unforgettable memories - from hotels, city breaks and holidays to theatre, entertainment and spa days. Experts in brightening up online travel, lastminute.com is among the worldwide leaders in the field, helping hundreds of thousands of customers every year find, and do, \"whatever makes them pink\".</p>\n<p>lastminute.com is part of lm group, publicly traded multinational Group, among the worldwide leaders in the online travel industry. Every month, the Group reaches across all its websites and mobile apps (in 17 languages and 40 countries) 60 million unique users that search for and book their travel and leisure experiences. More than 1,200 people enjoy working with us and contribute to provide our audience with a comprehensive and inspiring offering of travel related products and services</p>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p><strong>*Please note that is a full remote working job*</strong></p>\n<p><strong>*This vacancy is also eligible for the External Referral Programme: do you have a friend that you think can be interested in this position? Don’t keep it for yourself, <a href=\"https://smrtr.io/6L9K-\" rel=\"nofollow\">click here</a> and suggest us his/her profile! Check out how our External referral policy works <a href=\"https://docs.google.com/document/d/1hRAEiyqAJ8HKEvaTwNLJz8HLg-VIj26g6lfdYc3eTSQ/edit?usp=sharing\" rel=\"nofollow\">here</a> </strong></p>\n<p><strong>Are you willing to generate an impact on a product that is used by millions of users across multiple devices on a daily basis?</strong></p>\n<p>We have a daily challenge, which is to reach more than 60 million unique users (in 17 languages ​​and 40 countries) who want to book and personalize their next travel experience. For this reason, we are looking for software engineers who are passionate about challenges, such as creating a modern, scalable and resistant platform.</p>\n<p>As a react developer, you will work on our next generation frontend application, a specific project critical to our customer’s needs. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new challenges across the full-stack as we continue to push technology forward.</p>\n<p>Our products need to handle information at scale, and extends well beyond selling flights. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, UI design and mobile; the list goes on and is growing every day. </p>\n<p>We are Product oriented developers with a growth mindset. We are curious problem solvers and we like to collaborate, communicate, share knowledge and technical ideas and grow together.</p>\n<p>We give you autonomy over the software you build and offer you the freedom to choose the right tool for the job. </p>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<p>You’ll Spend Time On The Following:</p>\n<ul>\n<li>Collaborating with product managers and other engineers to create the best experience for our customers within our next generation frontend application.</li>\n<li>Ensuring operational excellence of services / applications.</li>\n<li>Understanding how our business works and how products add value to our customers.</li>\n<li>Learning and sharing experiences on new technologies and trends and how you can leverage them in current and future products.</li>\n<li>Collaborating and sharing knowledge with others across the group.</li>\n</ul>\n<p>We are looking for these skills/experience:</p>\n<ul>\n<li> Expert in ECMAScript 2019 </li>\n<li> Experience with React hooks, CSS-in-JS, Typescript and Jest</li>\n<li> Worked on Node web applications and SSR with Next.</li>\n<li> E2E tests with Cypress.</li>\n<li> Experience with web performance optimizations.</li>\n<li> Leverage and contribute to open source.</li>\n<li> Previous experience in startups or product companies.</li>\n<li>Our work language is English, so it is paramount to be fluent; both written and spoken. </li>\n</ul>\n<p>Additional Information</p>\n<p>Maybe you will appreciate this information:</p>\n<ul>\n<li>Part of global Product Engineering (team of ~250)</li>\n<li>Which is part of lastminute.com (team of ~1200)</li>\n<li>We have offices in 12 countries while headquartered in Switzerland.</li>\n</ul>\n<p>What do we offer.</p>\n<ul>\n<li>Possibility to work in an international and diverse team! We value you to be yourself!</li>\n<li>Continuous learning program with hands on  internal sessions and the possibility to join conferences around Europe for continuous improvement.</li>\n<li>Access to online learning platforms like O’Reilly </li>\n<li>Weekly internal training sessions during office hours to learn and grow, such as our “Coding Dojo” sessions which we use to learn and share coding techniques.</li>\n<li>LM-Talks: our very own knowledge sharing internal sessions.</li>\n<li>We'll provide you with top-notch hardware, a Macbook Pro 16\" with an external monitor</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n"
		},
		{
			"id": 739337,
			"url": "https://remotive.io/remote-jobs/software-dev/python-django-software-engineer-739337",
			"title": "Python + Django Software Engineer",
			"company_name": "WP Media",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-19T02:28:48",
			"candidate_required_location": "UTC+2 to UTC-7",
			"salary": "",
			"description": "<p>Are you an experienced Python and Django software engineer? Do you love building SaaS APIs and apps? Does building new features, squashing bugs, and continuously improving quality challenge you? Does legacy code make you want to refactor it to current best practices and standards? Does performance and making the web better, faster, and lighter excite you? Do you have a knack for teamwork with people from different backgrounds and skills?</p>\n<p> </p>\n<p>If you answered yes to these questions, we are sure this position will sound super exciting to you. 🤩</p>\n<p> </p>\n<p>We are looking for a friendly person in love with Python, Django, web performance, microservices, reusable code libraries, and quality <strong>to join our Product Software Engineering team</strong>. 🚀</p>\n<p> </p>\n<p>Keep reading for more details! 📝</p>\n<p> </p>\n<div class=\"h3\">Become Our New Software Engineer!</div>\n<p>In your job as a Software Engineer, your primary focus will be <strong>building new features, fixing bugs, optimization, and continuously improving our SaaS products</strong>.</p>\n<p><strong> </strong></p>\n<p><strong>WP Media</strong> is the French company behind successful WordPress plugins like WP Rocket and Imagify. WP Rocket is the premium <strong>caching plugin for WordPress</strong> used by +1,700,000 websites and +190,000 customers worldwide. Our plugin makes sites go at the speed of light in just a few clicks. Imagify is our <strong>free image optimization service</strong>, including a free WordPress plugin: we have already optimized more than 3,000,000,000 images! 😲</p>\n<p> </p>\n<p>You will <strong>join our Product Software Engineering Team. </strong>To facilitate this international teamwork, we require you to work in <strong>within one of these time zones UTC+2 to UTC-7</strong>. We are so curious to know which new country will be added to our distributed team map! 🌍</p>\n<div class=\"h3\"><br>What You Will Be Doing:</div>\n<p>Here is a list describing the tasks involved in this position (<em>do you happen to like making lists? So do we!</em>):</p>\n<p> </p>\n<ul>\n<li>Contribute to building, testing, and maintaining our SaaS products, APIs, and apps including new features, optimizations, bug fixes, and continuous improvement initiatives</li>\n<li>Scope, contribute to, and collaborate on technical solutions and specifications for each user story in our backlog.</li>\n<li>Join our the cross-functional Scrum Team in each sprint to pull in ready-to-build user stories and get each built, tested, demoed, and ready to ship</li>\n<li>Review pull requests to ensure each meets our standards, achieves the desired feature epic, story, or fix outcome, and does not cause side-effects</li>\n<li>Seek opportunities to make our products run faster, be easier to maintain, and be more reliable, robust, and scalable</li>\n<li>Collaboratively <strong>contribute to our code libraries, code reviews, process improvements, and technical decisions</strong>.</li>\n</ul>\n<p> </p>\n<p>During this journey, you will get <strong>cross-training and growth opportunities</strong> by working with your teammates on internal projects.</p>\n<p> </p>\n<div class=\"h3\">Requirements:</div>\n<ul>\n<li>Work comfortably within UTC+2 to UTC-7 time zone range, prefer European time zones.</li>\n<li>Be a strong written and spoken English communicator. Why? Though we are a global company, English is our company's working language. We require strong communication to ensure everyone can understand one another and collaborate well together.</li>\n<li>Strong agile SaaS product engineering experience specializing in Python and Django.</li>\n</ul>\n<p> </p>\n<div class=\"h3\">What Do You Need To Excel at This Job:</div>\n<p><strong>Being Yourself.</strong></p>\n<p> </p>\n<p>The WP Media team is diverse and composed of people from all over the world. <strong>Respect</strong>, <strong>collaboration</strong>, and <strong>inclusivity</strong> are some of our core values (<em>more on this below</em>). Every day of work is an exciting opportunity to get in touch with fantastic people who will enrich your cultural and professional background.</p>\n<p> </p>\n<p><strong>Proficient knowledge of English.</strong></p>\n<p> </p>\n<p>Empathetic and collaborative communication is key: you are comfortable writing, speaking, and listening in English with technical and non-technical teammates.</p>\n<p> </p>\n<p><strong>Passion and humbleness.</strong></p>\n<p> </p>\n<p>You are a skilled, passionate, and humble engineer who is friendly, collaborative, and supportive. Solving problems and building solutions that help people are the values that make your work special and rewarding.</p>\n<p> </p>\n<p><strong>Considering how your work impacts others.</strong></p>\n<p> </p>\n<p>Your code is a pleasure to use, read, and understand. When working in the codebase, you leave things better than when you found them. You value personal growth and constructive feedback. People feel good around you because you love sharing what you know while continuously improving yourself, remaining thoughtful and flexible in your approach.</p>\n<p> </p>\n<p><strong>Proven Django API expertise.</strong></p>\n<p> </p>\n<p>You are a skilled Django API engineer. You’ve built, maintained, scaled, and continuously improved APIs. You follow agile processes in collaborating during sprints with the rest of the team.</p>\n<p><br>Do you want to know a few other things we appreciate about our candidates? Don’t worry if you don’t have experience in any of these areas. We’ll teach you.</p>\n<p> </p>\n<ul>\n<li><strong>Worked in agile development, preferably Scrum.</strong></li>\n</ul>\n<p> </p>\n<p>We are an agile development team using the power of Scrum and 2-week sprints to focus our energies and efforts. You have experience working in an agile environment either with XP or Scrum. You love self-organizing, empowered Scrum teams. No experience in Scrum? Don’t worry. We’ll coach you.</p>\n<p> </p>\n<ul>\n<li><strong>Automated testing.</strong></li>\n</ul>\n<p> </p>\n<p>You have experience with automated testing, i.e. unit, integration, and maybe even e2e acceptance testing. You value how granular tests prove that your code works as expected even in unexpected conditions. Never built tests before? We’ll teach you a testing mindset and how to leverage automated testing suites to improve your code, our products and our libraries.</p>\n<p> </p>\n<ul>\n<li><strong>Previous freelance or remote job experience.</strong></li>\n</ul>\n<p> </p>\n<p>Slack will be your virtual office, where all the life of the company takes place.</p>\n<p> </p>\n<ul>\n<li><strong>Know the web performance.</strong></li>\n</ul>\n<p> </p>\n<p>We will train you for this, and we will always have your back, don't worry! But if you already have experience with web performance optimization, let us know. 😉</p>\n<p> </p>\n<ul>\n<li><strong>The involvement in the software community.</strong></li>\n</ul>\n<p> </p>\n<p>We support our teammates to attend and/or speak at conferences, and to volunteer within the community.</p>\n<p> </p>\n<ul>\n<li><strong>Love for cats or Corgis!</strong> 😸🐶</li>\n</ul>\n<p> </p>\n<p>What would our working days be without our four-legged friends?</p>\n<p> </p>\n<div class=\"h3\">What Else You Should Know About Our Company: WP Media</div>\n<p>Founded in 2014 in the beautiful Lyon, France, <a class=\"external\" href=\"http://wp-media.me\" rel=\"nofollow\">WP Media</a> is an equal opportunity employer with a distributed team of +35 teammates living around the world.</p>\n<p><img height=\"401\" src=\"https://lh4.googleusercontent.com/9bsKTNu3NQqaoai9F9vhc-5ULGrgUxcP1yrPQ7dASftWQWdiFKYyXo2R-f3MBD69TqO0ns-eHZH0vHfPy4hlBQIcwLjo1QJxBcaqT5XZbFwO8tAEARV_L3JrPqNKoMkvS5Qo78Bu\" width=\"602\"></p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">Do We Share the Same Values?</div>\n<p><strong>Mutual respect</strong>, <strong>collaboration</strong>, and <strong>inclusivity</strong>.</p>\n<p> </p>\n<p>These are the fundamental values that support our life as a team.</p>\n<p><strong> </strong></p>\n<p><strong>Healthy balance between work and private life. </strong></p>\n<p> </p>\n<p>We encourage our employees to enjoy their family and their hobbies with flexible working hours and minimum vacation policy (you should take a <em>minimum</em> of 5 weeks per year: really, we don’t count them!).</p>\n<p><img height=\"452\" src=\"https://lh3.googleusercontent.com/-Rv33lz15pP1l-3iGDOb-wpIJk_cr58LamlCX-I7BRzhE0EQ4k8J3yGEcP9Oa3NIixcznwuYG6F8H7xcUlgqEGeDcdUmRynJnoz_z_JzaIJ2dxcfE0aba2ZHNAe1LOQ2epAR5-A-\" width=\"602\"></p>\n<p> </p>\n<p><strong>We care about the work you do, not about the hours you sit at your desk.</strong></p>\n<p> </p>\n<p>You can organize your working day with flexible working hours. There are no time cards to stamp, just customers to make happy and friendly teammates to work with!</p>\n<p><strong> </strong></p>\n<p><strong>Transparent culture.</strong></p>\n<p> </p>\n<p>We have a <a class=\"external\" href=\"https://wp-rocket.me/blog/our-salary-grid-is-now-public/\" rel=\"nofollow\">public salary grid</a>. Once a year, when the company does well, we <strong>share our profits</strong> with the team in the form of bonuses.</p>\n<p><strong> </strong></p>\n<p><strong>We like to see each other in person whenever possible.</strong></p>\n<p> </p>\n<p>Every year, we organize a trip with the whole team and <strong>spend a week of coworking and fun activities together</strong>.</p>\n<p><br>To give you an idea, so far we have traveled to Spain, Portugal, and Mexico:</p>\n<p><img height=\"401\" src=\"https://lh6.googleusercontent.com/I3FVVvzccB_tqPkQr8RDBYxr-V0wir0lr_YJ7TKWcVo8PkJBwF0XEp_lURO2ojcHk9-C6O3YQZ7qFb3vzJqkYsa6vWYl3dxiM1UhhdIfyPXQ4uY9Cq-LoogB1FLcEP2uBUkZTzHj\" width=\"602\"></p>\n<p> </p>\n<p>Now that we've told you so much about us, it's your turn. 😉</p>\n<p> </p>\n<p>Let us know why you would like to become our <strong>Software Engineer</strong> and why you think you are the person we are looking for.</p>\n<p> </p>\n<p>We can’t wait to receive your application! 🌟</p>\n"
		},
		{
			"id": 739323,
			"url": "https://remotive.io/remote-jobs/software-dev/php-developer-739323",
			"title": "PHP Developer",
			"company_name": "WP Media",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-18T20:17:47",
			"candidate_required_location": "between UTC+2 to UTC-7",
			"salary": "",
			"description": "<p>Are you a PHP developer who loves building new features, squashing bugs, and continuously improving quality? Do you love optimizing code? Does legacy code make you want to refactor it to current best practices and standards? Do you love making websites run faster? Does making complexity simple excite you? Do you have a knack for teamwork with people from different backgrounds and skills?</p>\n<p> </p>\n<p>If you answered yes to these questions, we are sure this position will sound super exciting to you. 🤩</p>\n<p> </p>\n<p>We are looking for a friendly person in love with PHP, web performance, modular reusable code libraries, and quality to <strong>join our Product Development team.</strong> 🚀</p>\n<p> </p>\n<p>Keep reading for more details! 📝</p>\n<p> </p>\n<div class=\"h3\">Become Our New PHP Developer!</div>\n<p>In your job as a PHP Developer, your primary focus will be <strong>building new features, fixing bugs, and continuously improving our WordPress plugin products, including WP Rocket</strong>.</p>\n<p> </p>\n<p><strong>WP Media</strong> is the French company behind successful WordPress plugins like WP Rocket and Imagify. WP Rocket is the premium <strong>caching plugin for WordPress</strong> used by +1,700,000 websites and +190,000 customers worldwide. Our plugin makes sites go at the speed of light in just a few clicks. Imagify is our <strong>free image optimization service</strong>, including a free WordPress plugin: we have already optimized more than 3,000,000,000 images! 😲</p>\n<p> </p>\n<p>You will <strong>join our remote, global Development team</strong>, which is spread across the U.S., Canada, France, Egypt, Spain, and Romania. To facilitate this international teamwork, you must live or work in a <strong>time zone between UTC+2 to UTC-7</strong>. We are so curious to know which new country will be added to our distributed team map! 🌍</p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">What You Will Be Doing:</div>\n<p>Here is a list describing the tasks involved in this position (<em>do you happen to like making lists? So do we!</em>):</p>\n<p> </p>\n<ul>\n<li>Contribute to <strong>continuously improving WP Rocket</strong> through new features and big fixes development.</li>\n<li>Scope, contribute to, and collaborate on technical solutions and specifications for each user story in our backlog.</li>\n<li>Collaborate with the cross-functional Dev team in each sprint to pull in ready-to-build user stories and get each built, tested, demoed, and ready to ship</li>\n<li>Review pull requests to ensure each meets our standards, achieves the desired feature epic, story, or fix outcome, and does not cause side-effects</li>\n<li>Seek opportunities to make our plugin products run faster, be easier to maintain, and be more reliable, robust, and scalable</li>\n<li>Collaboratively <strong>contribute to our code libraries, code reviews, process improvements, and technical decisions.</strong></li>\n</ul>\n<p> </p>\n<p>During this journey, you will get <strong>cross-training and growth opportunities</strong> by working with your fellow Dev teammates on internal projects.</p>\n<p> </p>\n<div class=\"h3\">What Do You Need To Excel at This Job:</div>\n<p><strong>Being Yourself.</strong></p>\n<p> </p>\n<p>The WP Media team is diverse and composed of people from all over the world. <strong>Respect</strong>, <strong>collaboration</strong>, and <strong>inclusivity</strong> are some of our core values (<em>more on this below</em>). Every day of work is an exciting opportunity to get in touch with fantastic people who will enrich your cultural and professional background.</p>\n<p><strong> </strong></p>\n<p><strong>Proficient knowledge of English.</strong></p>\n<p> </p>\n<p>Empathetic and collaborative communication is key: you are comfortable writing, speaking, and listening in English with technical and non-technical teammates.</p>\n<p><strong> </strong></p>\n<p><strong>Passion and humbleness.</strong></p>\n<p> </p>\n<p>You are a skilled, passionate, and humble developer who is friendly, collaborative, and supportive. Solving problems and building solutions that help people are the values that make your work special and rewarding.</p>\n<p><strong> </strong></p>\n<p><strong>Considering how your work impacts others.</strong></p>\n<p> </p>\n<p>Your code is a pleasure to use, read, and understand. When working in the codebase, you leave things better than when you found them. You value personal growth and constructive feedback. People feel good around you because you love sharing what you know while continuously improving yourself, remaining thoughtful and flexible in your approach.</p>\n<p><strong> </strong></p>\n<p><strong>Solid PHP expertise.</strong></p>\n<p> </p>\n<p>You will bring proven experience in building, improving, and maintaining PHP solutions. You develop using modern PHP (for example, OOP, Composer, or PSR’s) but also know when to use procedural.</p>\n<p> </p>\n<p><em>Do you want to know a few other things we appreciate about our candidates? Don’t worry if you don’t have experience in any of these areas. We’ll teach you.</em></p>\n<p><em> </em></p>\n<ul>\n<li><strong>Know WordPress.</strong></li>\n</ul>\n<p> </p>\n<p>Our products are built on top of and used within WordPress. We use a superset of WordPress coding standards. If you don’t have WordPress experience, we’ll teach you. We’ll show you how to leverage its APIs and helper functionality.</p>\n<p> </p>\n<ul>\n<li><strong>Automated testing.</strong></li>\n</ul>\n<p> </p>\n<p>You have experience with automated testing, i.e. unit, integration, and maybe even e2e acceptance testing. You value how granular tests prove that your code works as expected even in unexpected conditions. Never built tests before? We’ll teach you a testing mindset and how to leverage automated testing suites to improve your code, our products and our libraries.</p>\n<p> </p>\n<ul>\n<li><strong>Automated code validation.</strong></li>\n</ul>\n<p> </p>\n<p>You think code should comply with PHPCS as well as best practices. You value automated code validation to do pre-code reviews while reducing our manual code review process. Don’t worry if you haven’t used PHPCS before. Why? It’s built into our development pipeline. We’ll teach you.</p>\n<p> </p>\n<ul>\n<li><strong>Previous freelance or remote job experience.</strong></li>\n</ul>\n<p> </p>\n<p>Slack will be your virtual office, where all the life of the company takes place.</p>\n<p> </p>\n<ul>\n<li><strong>Know the web performance.</strong></li>\n</ul>\n<p> </p>\n<p>We will train you for this, and we will always have your back, don't worry! But if you already have experience with web performance optimization, let us know. 😉</p>\n<p> </p>\n<ul>\n<li><strong>The involvement in the developer community.</strong></li>\n</ul>\n<p> </p>\n<p>We support our teammates to attend and/or speak at conferences, and to volunteer within the community.</p>\n<p> </p>\n<ul>\n<li><strong>Love for cats or Corgis!</strong> 😸🐶</li>\n</ul>\n<p> </p>\n<p>What would our working days be without our four-legged friends?</p>\n<p> </p>\n<div class=\"h3\">What Else You Should Know About Our Company: WP Media</div>\n<p>Founded in 2014 in the beautiful Lyon, France, <a class=\"external\" href=\"http://wp-media.me\" rel=\"nofollow\">WP Media</a> is an equal opportunity employer with a distributed team of +35 teammates living around the world.</p>\n<p><br><img alt=\"\" src=\"https://workablehr.s3.amazonaws.com/uploads/photos/12886/aab10eb0b776866386d1147b2467690b.jpg\" title=\"\"></p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">Do We Share the Same Values?</div>\n<p><strong>Mutual respect</strong>, <strong>collaboration</strong>, and <strong>inclusivity</strong>.</p>\n<p> </p>\n<p>These are the fundamental values that support our life as a team.</p>\n<p><strong> </strong></p>\n<p><strong>Healthy balance between work and private life.</strong></p>\n<p> </p>\n<p>We encourage our employees to enjoy their family and their hobbies with flexible working hours and minimum vacation policy (you should take a <em>minimum</em> of 5 weeks per year: really, we don’t count them!).</p>\n<p><br><img alt=\"\" src=\"https://workablehr.s3.amazonaws.com/uploads/photos/12886/b01b23f92b80e30df4db10d06766d469.jpg\" title=\"\"></p>\n<p><strong> </strong></p>\n<p><strong>We care about the work you do, not about the hours you sit at your desk.</strong></p>\n<p> </p>\n<p>You can organize your working day with flexible working hours. There are no time cards to stamp, just customers to make happy and friendly teammates to work with!</p>\n<p><strong> </strong></p>\n<p><strong>We like to see each other in person whenever possible.</strong></p>\n<p> </p>\n<p>Every year, we organize a trip with the whole team and <strong>spend a week of coworking and fun activities together</strong>.</p>\n<p> </p>\n<p>To give you an idea, so far we have traveled to Spain, Portugal, and Mexico:</p>\n<p><br><img alt=\"\" src=\"https://workablehr.s3.amazonaws.com/uploads/photos/12886/cd168b3f16d7b68196cdbf5baa833938.jpg\" title=\"\"></p>\n<p>Now that we've told you so much about us, it's your turn. 😉</p>\n<p> </p>\n<p>Let us know why you would like to become our <strong>PHP Developer</strong> and why you think you are the person we are looking for.</p>\n<p> </p>\n<p>We can’t wait to receive your application! 🌟</p>\n"
		},
		{
			"id": 949796,
			"url": "https://remotive.io/remote-jobs/software-dev/engineering-manager-f-m-949796",
			"title": "Engineering Manager (f/*/m)",
			"company_name": "Frontastic",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-18T20:02:53",
			"candidate_required_location": "Anywhere",
			"salary": "€64k - €92k",
			"description": "<div class=\"JA-description__text\">\n<div class=\"h3\">About us</div>\n<p>Frontastic was founded in 2017 as a fully remote company, and we've been working that way ever since. Our People team works tirelessly to empower our staff and give them an incredible working experience.</p>\n<p>We're rapidly growing our team to reach our mission: Let commerce teams build the incredible.</p>\n<p>Frontastic is a Composable Frontend Platform that unites business and development teams to build commerce sites on top of headless. Our customers see higher conversion rates, increased developer productivity, and a faster time to market.</p>\n<p>If you want to learn more about our product, watch our <a href=\"https://www.frontastic.cloud/?wvideo=e1ydd7o7xr\" rel=\"nofollow\">product demo video on our website</a> (www.frontastic.cloud).</p>\n<p> </p>\n<p>Role summary</p>\n<p>Do you like working with humans in technical teams and helping to solve personal specific impediments? Do you love to see people discuss and implement ambitious ideas emerging from a technical and product vision? Then this role could be for you!</p>\n<p>You'll manage our Engineering team(s). You'll have regular 1:1s with everybody in engineering to ensure there are no impediments. You'll be the communicator between the CTO and all developers. You'll also work to influence how the team collaborates and grows in the future.</p>\n<p> </p>\n<div class=\"h3\">What you'll do </div>\n<ul>\n<li>Actively work with our engineering people as a coach. You'll bring the best out of people to help them achieve their ambitions. You'll stay in contact with all team members to drive their development and to evaluate their performance.</li>\n<li>Work alongside our Product, Design, and Engineering team members. You'll be accountable for optimizing the performance of the Engineering teams and finding ways to make improvements.</li>\n<li>Be involved in hiring high-quality engineers and building great teams. You'll assess the current team and identify the skill gaps to create hiring plans with our People team.</li>\n<li>Enable a cohesive technical vision by working with the team and ensuring voices of senior staff are heard when needed to ensure architectural cohesion, and you'll identify and address challenges when it comes to cross-system communication during planning.</li>\n</ul>\n<p> </p>\n<div class=\"h3\">What it's like to work in our Developer Experience team?</div>\n<p>Our team is here to make sure that our platform gives the best user experience possible.</p>\n<ul>\n<li>We're working hard on enhancing the stack and tooling so that our customers can enjoyably create the best commerce sites on the planet. This is how our value <strong>Make an impact</strong> really drives us every day.</li>\n<li>We're also <strong>a genuine team.</strong> When we come across challenges, we make sure that we can always rely on each other's strengths and openness (<strong>We're in this together)</strong> — both within the team and beyond the team. We regularly practice pair programming or co-working because working in a remote team doesn't mean having to work alone.</li>\n<li>We're <strong>passionate learners.</strong> Technology is always evolving, and we're constantly on the lookout for new ideas that could improve the experience for our customers. Our value <strong>Thirst for learning</strong> has special meaning for our team. To achieve our goals, we have a curiosity that motivates the study, willingness to exchange knowledge, and acceptance that sometimes we fail in order to learn more.</li>\n</ul>\n<p> </p>\n<div class=\"h3\"><strong>Expectations for your first 3 months</strong></div>\n<ul>\n<li>Takeover all 1:1 meetings for the Engineering team</li>\n<li>Make yourself familiar with the product, the product roadmap, and the processes and workflows of the development teams</li>\n<li>Develop a good understanding of where the team is currently at and you'll have ideas on how to help the team to enhance their cooperation and ways of working</li>\n</ul>\n<div class=\"h3\"><br>You'll have</div>\n<ul>\n<li>A solid technical background so that you understand the technical aspects of the Frontastic product and engineering work plans</li>\n<li>Able to assess and track how your team members are currently feeling</li>\n<li>Proficient in asking open questions to help your team members define goals and work with them to develop plans for skill development</li>\n<li>Competent at moderating meetings and helping the team to collaborate more closely while also making sure there's a consistent output of the team</li>\n<li>Capable of discussing hiring and other requirements with the Leadership team and People teams from a technical and business perspective</li>\n<li>Able to work closely with our Product team to produce the product roadmap</li>\n<li>Experience working remotely, either leading a remote team or as a senior contributor</li>\n<li>Excellent written and verbal communication skills in English as you'll coach teams and individuals and teams to help them reach their full potential</li>\n</ul>\n<p> </p>\n<div class=\"h3\"><strong>Our stack</strong></div>\n<ul>\n<li>React (plain and TypeScript) and Next.js in the frontend</li>\n<li>MaterialUI, SCSS and Tailwind</li>\n<li>PHP with Symfony and Node.js in the backend</li>\n<li>MySQL and CouchDB as databases</li>\n</ul>\n<p> </p>\n<p><strong>Your package</strong></p>\n<p>For this role, we're offering a full-time salary of €64k - €92k.</p>\n<p> </p>\n<p><strong>Our hiring process for this role is:</strong></p>\n<ul>\n<li>CV screening</li>\n<li>Pre-screening call with our Chief Technology Officer</li>\n<li>Culture questions (via. email)</li>\n<li>Initial interview with our current Engineering Manager and Chief Technology Officer</li>\n<li>Stakeholder lunch where you'll get the opportunity to meet some of your co-workers</li>\n</ul>\n<p>We aim to respond to all candidates within 72 hours (except weekends).</p>\n<p> </p>\n<div class=\"h3\">We'd love to hear from you</div>\n<p>Visit our <a href=\"https://www.frontastic.cloud/careers\" rel=\"nofollow\">careers page</a> on our website to find out more. If you have any questions, email us at <a href=\"mailto:people@frontastic.cloud\" rel=\"nofollow\">people@frontastic.cloud</a>.</p>\n<p> </p>\n<div class=\"h3\"><strong>Equal opportunities</strong></div>\n<p>We're an equal opportunity employer and value diversity at our company. We don't discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n</div>\n",
			"company_logo_url": "https://remotive.io/job/949796/logo"
		},
		{
			"id": 930689,
			"url": "https://remotive.io/remote-jobs/software-dev/python-team-lead-software-engineer-930689",
			"title": "Python Team Lead Software Engineer",
			"company_name": "Tucows",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-18T15:26:57",
			"candidate_required_location": "",
			"salary": "$100,000 - $150,000 per year",
			"description": "<p><font color=\"#303952\"><span style=\"white-space: pre-wrap;\">We are looking for an experienced Software Engineering Lead to guide our team, which builds and maintains a host of services that are used across all of Tucows’ major business units. We are evolving our platforms to microservices to enable functions within Tucows across all of our platforms.\r\n</span></font></p><p></p><hr><p><font color=\"#303952\"><span style=\"white-space: pre-wrap;\">\n</span></font><strong style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>What You’ll Do:</strong>\n</p><ul style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'><li><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Lead a team of engineers to build and support scalable, reliable, and resilient microservices</span></li><li><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Provide level of effort estimates for delivering features and ensure your team meets those commitments.</span></li><li><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Collaborate with other Engineering Team Leads to define shared services’ features, including technical and performance requirements.</span></li><li><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Lead the development process with Agile software development tools and standard methodologies</span></li><li><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Learn, grow, and have fun!</span></li></ul><p><font color=\"#000000\"><span style=\"letter-spacing: 0.75px; white-space: pre-wrap;\"><strong><br></strong></span></font><strong style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Who You Are:</strong></p><ul><li><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>You have 3+ years leading a team of engineers that developed customer facing applications</span></li><li>You think carefully about how to roll out features and improvements to the applications you support while minimizing/avoiding customer downtime</li><li>Have software engineering experience and a consistent record of writing elegant, maintainable, self-documenting code in Python.</li><li>You have 5+ years of software engineering experience.</li><li>You have experience with web frameworks such as Flask, Django, and FastAPI.</li><li>Have experience with open source databases such as Postgres and MariaDB.</li><li>You are familiar with microservice architecture frameworks and design patterns.</li><li>You understand modern CICD practices that include Infrastructure as Code and automated deployment pipelines</li><li>You know, and can demonstrate, the value of agile processes, continuous integration, and continuous delivery.</li><li>You enjoy sharing your knowledge with people you work with.</li><li>You have excellent written and verbal communication skills.</li><li>You love to collaborate, are a great teammate, an excellent listener, and are fun to work with.</li></ul><p><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>\n<strong>Who You Might Be:</strong>\n</span></p><ul><li><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Someone with wholesale or retail domain names experience.</span></li><li><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>A person who’s worked for an ISP.</span></li></ul><p><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Someone that’s familiar with telcos, especially MVNOs.\r\n</span></p><p></p><hr><p><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'><strong>About Tucows:</strong></span></p><p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>\r\nTucows (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.\r\n</span></p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'><br></span><p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>We embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!</span></p><p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>____________________________________________________________________________________</span></p><p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>\r\nToday, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!\r\n</span></p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'><br></span><p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Want to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality.\r\n</span></p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'><br></span><p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>We also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view.\r\n</span></p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'><br></span><p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation.\r\n</span></p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'><br></span><p><span style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>Learn more about Tucows, our culture and employee benefits at </span><a class=\"smp-text-link\" href=\"http://tucows.com/careers/\" rel=\"nofollow\" style='font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap; background-color: white; text-decoration: none; color: rgb(33, 150, 243);' target=\"_blank\">tucows.com/careers/</a><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'><br></span></p><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'><br></span><p><span style='color: rgb(48, 57, 82); font-family: Roboto, \"Helvetica Neue\", sans-serif; white-space: pre-wrap;'>\r\n(433)</span></p>\n",
			"company_logo_url": "https://remotive.io/job/930689/logo"
		},
		{
			"id": 949484,
			"url": "https://remotive.io/remote-jobs/software-dev/full-stack-developer-949484",
			"title": "Full Stack Developer",
			"company_name": "Volcanic Internet SL",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-18T08:34:50",
			"candidate_required_location": "Europe Only",
			"salary": "40.000€ - 50.000€ per year",
			"description": "<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\">At Volcanic Internet we like to take care of the solutions we develop for our clients. We stand by their challenges so they can feel proud of our solutions.</p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\">If you are passionate about technology, eager to work hard in challenging projects, be in direct contact with the clients to better understand their problems and want to join a small but ambitious team, Volcanic is your next destination!</p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"><strong>Location</strong></p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\">Our main office is in Olot (Girona), but our team is spread in locations like Girona, Barcelona, Liverpool or Brazil right now so remote is welcome too.</p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"><strong>We offer</strong></p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"> </p>\n<ul>\n<li>High performance work environment with experienced profiles and multidisciplinary team</li>\n<li>In house tech talks with continuous training</li>\n<li>External training</li>\n<li>Innovation in each of the new solutions. Not all the problems have the same solution</li>\n<li>Teamwork</li>\n<li>Flexible hours and vacation time</li>\n<li>Agile methodologies: sprints, scrum, lean...</li>\n<li>Don't hesitate to contact any of our team members to ask about life at Volcanic Internet.</li>\n</ul>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"><strong>Your role</strong></p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\">You'll develop using a variety of coding languages. Each project has its own stack and requirements and you might be working on your own in the project or cooperating with other members of the team.</p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\">We look for experienced coders with hands on mindset. We don't care as much about your CV as the battles you have been into and what you've learnt in each of them.</p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"><strong>Personal skills</strong></p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"> </p>\n<ul>\n<li>Common sense to develop optimal solutions that really solve problems in the most efficient way possible for the user</li>\n<li>Teamwork. At Volcànic we always work as a team and the solutions to the problems posed are openly discussed. We are looking for a participatory person but at the same time also independent. It's not just about bringing problems, it's also about coming up with thought-provoking solutions.</li>\n<li>Proactive.</li>\n<li>Organisational and communicative capacity.</li>\n<li>English: read, written and spoken. We have international clients and communications can be in English</li>\n</ul>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"><strong>Technical skills</strong></p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\">We are looking for a developer that can feel comfortable assuming front and backend tasks and the knowledge of as many of the following technologies is a plus:</p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"> </p>\n<ul>\n<li>PHP</li>\n<li>MySQL</li>\n<li>TypeScript</li>\n<li>HTML5/CSS3</li>\n<li>CSS preprocessors: SASS</li>\n<li>APIs integration</li>\n<li>Perfect understanding of the different development environments (staging, production, development)</li>\n<li>Familiar with GIT version control</li>\n</ul>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"><strong>Nice to Have</strong></p>\n<p style=\"margin-bottom: 1.3125rem; padding: 0px; border-width: initial; border-style: none; color: #161616; font-family: -apple-system, system-ui, 'Helvetica Neue', 'Segoe UI', Arial, Helvetica, Roboto, sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol', 'Noto Color Emoji'; font-size: 15px; outline: none !important;\"> </p>\n<ul>\n<li>Regular expressions</li>\n<li>Nodejs</li>\n<li>Go</li>\n<li>Marcojs</li>\n<li>React</li>\n<li>Angular</li>\n<li>Non relational databases</li>\n<li>Project management skills</li>\n</ul>\n<p> </p>\n<p>Send your presentation letter along with your CV to <a href=\"mailto:info@volcanicinternet.com\" rel=\"nofollow\">info@volcanicinternet.com</a></p>\n"
		},
		{
			"id": 737488,
			"url": "https://remotive.io/remote-jobs/software-dev/senior-java-engineer-737488",
			"title": "Senior Java Engineer",
			"company_name": "Help Scout",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-18T02:11:50",
			"candidate_required_location": "Anywhere between MT and CET",
			"salary": "$129,000 - $149,000",
			"description": "<div>As a member of one of our Customer Experience Teams you will be building software applications and APIs in Kotlin and Java. You’ll work on creating delightful product features for our customers to either increase their productivity, ensure their customer service is proactive, personalized, and meaningful, or <a class=\"postings-link\" href=\"https://www.helpscout.com/knowledge-base/\" rel=\"nofollow\">knowledge base</a>.</div>\n<div> </div>\n<div>These products empower over 12,000 companies around the world to deliver world class support to their customers and our APIs serve tens of millions of requests per day.</div>\n<div> </div>\n<div>The ideal engineer for this position enjoys building and collaborating with designers, product managers, and other engineers on elegant solutions. You relish the opportunity to tackle both customer and product orientated problems.</div>\n<p><br><br></p>\n<div class=\"h3\">Currently at Help Scout</div>\n<ul>\n<li>We develop in <strong>Java</strong>, <strong>Kotlin</strong>, JavaScript and PHP</li>\n</ul>\n<ul>\n<li>We leverage AWS, Redis, RabbitMQ, Aurora MySQL, PostgreSQL, MongoDB</li>\n</ul>\n<ul>\n<li>We also use Slack, Jira, Github, Jenkins, Docker, Drone</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">About the role</div>\n<ul>\n<li>You will be working as a member of a small cross-functional team alongside another JVM engineers, as well as JavaScript and/or PHP engineers (depending on the role), a product manager and designer.</li>\n</ul>\n<ul>\n<li>The engineering team is made up of 50 people spread across several small, cross-functional teams. These teams contain all the back-end and front-end talent to deliver exciting new capabilities.</li>\n</ul>\n<ul>\n<li>On a daily basis, you'll work on new functionality, and be involved in the decisions made regarding implementation, testing, and backlog prioritization. You will collaborate with the rest of the engineering team through code reviews and participate in making architectural decisions.</li>\n</ul>\n<ul>\n<li>Our APIs serve tens of millions of requests per day.</li>\n</ul>\n<ul>\n<li>We work using an iterative software approach, communicate mostly via Slack and are committed to remote, agile development. </li>\n</ul>\n<ul>\n<li>You’ll work autonomously for the most part and we trust you to get work done when/where you can be productive.</li>\n</ul>\n<ul>\n<li>Your team performs engineering support when a question can’t be answered by our in-house support team and passes triage. We’ll get you up-to-speed with engineering support so you can help our customers and improve the product along the way.</li>\n</ul>\n<ul>\n<li>Everything is secondary to the customer experience. We expect you to have a keen sense of how your code will impact the experience in terms of performance, security and usability.</li>\n</ul>\n<ul>\n<li>You'll be working with product people that challenge you to get better every day. The founders are technical and committed to creating a magical experience for customers. You'll deploy work that moves the needle for businesses around the world.</li>\n</ul>\n<ul>\n<li>You will periodically partner with our Talent team to help us hire our future team members.</li>\n</ul>\n<ul>\n<li>In order to ensure enough team overlap, you're located anywhere between Mountain Time and Central European Time zones.</li>\n</ul>\n<ul>\n<li>Salary: We have an internal transparent salary matrix for each team. Read more about how we approach compensation <a class=\"postings-link\" href=\"https://www.helpscout.com/blog/employee-compensation/?utm_term=&amp;utm_campaign=Performance_Max&amp;utm_source=adwords&amp;utm_medium=ppc&amp;gclid=Cj0KCQjw--GFBhDeARIsACH_kdaB-QyipOjV7hva70dRuVPMXBqVgOqBf6yH8YpHVBUkVFLCTXy7QWMaAuj5EALw_wcB\" rel=\"nofollow\">here</a>! For this role, we have $129,000 to 149,000 USD slated in the budget.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">About you:</div>\n<ul>\n<li>You became an engineer because you like writing software that helps people.</li>\n</ul>\n<ul>\n<li>You bring a level of Java-specific expertise that will help us deliver an outstanding experience for customers and fellow developers.</li>\n</ul>\n<ul>\n<li>You have experience collaborating with other engineers, product, and design folks to craft relevant, customer-focused solutions, that serve high volumes of traffic.</li>\n</ul>\n<ul>\n<li>You are excited about the JVM ecosystem.</li>\n</ul>\n<ul>\n<li>You are a skilled, passionate, and humble engineer who is friendly, collaborative, and supportive. You want to be challenged by the work and not the workload. You are willing to ask for help when necessary and unafraid to say,“I don’t know.” At the same time, you have the confidence to take on complex and challenging problems.</li>\n</ul>\n<ul>\n<li>You value personal growth and constructive feedback. Believing that“a rising tide lifts all ships,” you make everyone around you better sharing what you have learned and looking for ways to improve both yourself and the team.  </li>\n</ul>\n<ul>\n<li>You demonstrate an empathetic, organized and collaborative communication style with fellow engineers and non-engineering stakeholders. Clear communication is super important in a remote culture like ours. </li>\n</ul>\n<ul>\n<li>You will consider how your work impacts others, and demonstrate thoughtful, flexible approaches to mentoring and guiding technical decisions.</li>\n</ul>\n<ul>\n<li>Your code is not only a pleasure for customers to use, but for other engineers to read and understand easily. When working in the codebase, you leave things better than you found them.</li>\n</ul>\n<ul>\n<li>You believe remote teams are the future of work, or are at least excited about the idea. You have experience working with remote teams or can adjust your work/management style to be remote-friendly.</li>\n</ul>\n<div><span style=\"font-size: 24px;\">Benefits</span></div>\n<div><strong>Competitive salary</strong> - Our salary formula is public to all employees (but doesn't divulge your specific salary) and we update it at least once per year. Your salary is the same no matter where you live. Our goal is to pay at or above the market rate of a US-based tech hub like Boston or Seattle.</div>\n<div> </div>\n<div><strong>Health and dental insurance</strong> - We cover you and your family's health/dental insurance 100%. If you are based in the US, we'll cover you on our Aetna policy. If you're based outside the US, we'll reimburse your out-of-pocket health and dental insurance costs.</div>\n<div> </div>\n<div><strong>Long-term/short-term disability insurance &amp; life insurance</strong> - we cover 100% of the premiums for LT/ST disability insurance and base life insurance. You also have the option to purchase supplementary life insurance through our provider (currently US only).</div>\n<div> </div>\n<div><strong>Flexible vacation</strong> - Take time off when you need it! We recommend 3-4 weeks in addition to public holidays, but there are no firm rules. We trust you.</div>\n<div> </div>\n<div><strong>Sabbatical</strong> - After you've been at Help Scout for 4 years, you get a month of paid vacation (in addition to regular vacation) and $2,500 to spend towards travel, learning, projects or anything else during your time off. <a class=\"postings-link\" href=\"https://www.helpscout.com/blog/sabbatical-from-work/\" rel=\"nofollow\">Read about what our CEO did.</a></div>\n<div> </div>\n<div><strong>Paid parental leave, including adoption </strong>- 12 weeks of paid leave for all new parents.</div>\n<div> </div>\n<div><strong>401k with 1% match</strong>- via Betterment for Business (currently US only)</div>\n<div> </div>\n<div><strong>Personal Development stipend</strong> - Up to $1,800 per year to improve your craft</div>\n<div> </div>\n<div><strong>Bonuses - </strong>everyone is eligible to receive a quarterly bonus up to 8% based on shared company revenue goals.</div>\n<div> </div>\n<div><strong>Set you up for success</strong> — we’ll get every new teammate a Mac laptop or equivalent of their choice, and provide a $1500 stipend so you can feel ready to work from home. We also cover up to $350 USD per month if you'd like to rent a co-working desk somewhere.</div>\n<div> </div>\n<div><strong>Complete transparency</strong> - Everyone has full access to business metrics and financial information about the company.</div>\n<div> </div>\n<div><span style=\"font-size: 24px;\">About Us</span></div>\n<div><a class=\"postings-link\" href=\"https://www.helpscout.com/\" rel=\"nofollow\">Help Scout</a> is made by roughly 110 people in 80+ cities around the world, all with a passion for helping others. We come from diverse backgrounds and are united by an enthusiasm for great products and delightful customer experiences. Help Scout launched in 2011 and today we have more than 12,000 paying customers in 140+ countries.</div>\n<div> </div>\n<div><span style=\"font-size: 24px;\">Why Help Scout?</span></div>\n<div><strong>We're remote.</strong> It doesn’t matter if you’ve worked remotely before — we’ve been doing it for nearly a decade and are <a class=\"postings-link\" href=\"https://www.helpscout.net/blog/remote-culture/\" rel=\"nofollow\">helping to write the playbook</a> — we’re happy to show you the ropes. Most folks that get a taste of working in a \"remote first\" company have a hard time going back to the old way of doing things.</div>\n<div> </div>\n<div><strong>We’re passionate about diversity and inclusion.</strong> The data is abundantly clear about diverse teams being more successful, and we're dedicated to setting the team up for success. Today our leadership team is 62% women, and that's just the start. Here's our <a class=\"postings-link\" href=\"https://www.helpscout.com/dei/\" rel=\"nofollow\">DEI Dashboard</a> where you can see all of our team demographic data and read about our commitment to this work.</div>\n<div> </div>\n<div><strong>We're committed to SMBs for the long term.</strong> Help Scout is focused entirely on serving small and midsize businesses, typically up to 500 employees, because those companies view customer service differently. It's not a cost to be optimized, it's their most effective marketing tool and a key differentiator from the competition. We built Help Scout for companies that truly <em>value</em> being customer-centric (like us) and want a product that shares their values.</div>\n<div> </div>\n<div><strong>We're leaving the world better than we found it.</strong> Did you know Help Scout is a certified B Corporation, with a mission to give away at least 1% of our product through <a class=\"postings-link\" href=\"https://www.helpscout.com/for-good/\" rel=\"nofollow\">Help Scout for Good</a>? Our company exists not just to help ourselves, but to invest in our team, our customers, our community, and our environment.</div>\n<div> </div>\n<div><span style=\"font-size: 24px;\">Our commitment to you</span></div>\n<div>We are an equal opportunity employer and are committed to building a company that embraces and celebrates <a class=\"postings-link\" href=\"https://www.helpscout.com/blog/diversity-inclusion-2019/\" rel=\"nofollow\">diversity and inclusion</a>. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status. We have read the studies and understand that diverse teams build better products, bring more perspective to the table, contribute to a company’s financial success and help foster a more inclusive environment for all employees, but the bottom line is that it's the right thing to do.</div>\n<p><br><br></p>\n",
			"company_logo_url": "https://remotive.io/job/737488/logo"
		},
		{
			"id": 737492,
			"url": "https://remotive.io/remote-jobs/software-dev/java-engineer-737492",
			"title": "Java Engineer",
			"company_name": "Help Scout",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-18T02:11:35",
			"candidate_required_location": "Anywhere",
			"salary": "$129,000 to 156,000 USD",
			"description": "<div>Join the Search and Data Services team at Help Scout! Your work on this team will power critical search capabilities that our customers depend on every day. You’d manage large, frequently changing data-sets with thousands of transactions per second!</div>\n<div> </div>\n<div>Our ideal candidate takes pride in building coherent and usable interfaces, choosing the right tools for the job and creating elegant, scalable solutions. Your work as an experienced JVM Engineer will empower over 12,000 businesses around the world to provide excellent customer service and will support the other senior engineers on your team. </div>\n<div> </div>\n<div>We leverage Ignite, Solr and Lucene for several tools at Help Scout, but knowledge or even expertise in these tools is <strong>not</strong> required. It is a nice bonus, though.</div>\n<p><br><br></p>\n<div class=\"h3\">Currently at Help Scout</div>\n<ul>\n<li>We develop in <strong>Java</strong>, <strong>Kotlin</strong>, JavaScript and PHP</li>\n</ul>\n<ul>\n<li>We leverage Solr, Lucene, Ignite, Kafka, RabbitMQ, MySQL, PostgreSQL and MongoDB</li>\n</ul>\n<ul>\n<li>We are heavy users of the AWS ecosystem</li>\n</ul>\n<ul>\n<li>We also use Slack, Jira, Github, and Drone CI</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">About the role</div>\n<ul>\n<li>Engineering at Help Scout is about 50 people, around half of the company, and you will join our Search and Data Services team. You'll collaborate on the next generation of our large-scale search and reporting service and associated infrastructure. </li>\n</ul>\n<ul>\n<li>On a daily basis, you'll work on adding new functionality, improving existing code, and API endpoints while maintaining focus on scalability, testing and documentation.</li>\n</ul>\n<ul>\n<li>You will play a key role in our journey towards a more holistic adoption of DevOps practices.</li>\n</ul>\n<ul>\n<li>We currently index millions of search and report events every day, and at peak hours, our API handles tens of thousands of transactions a minute. You will play a key role in evolving our services to handle 10x that.</li>\n</ul>\n<ul>\n<li>You will collaborate with the team on building a streaming data reports pipeline, reworking how we index data and retrieve data to scale while controlling infrastructure costs, and significantly improving our search relevancy and customer-facing reporting capabilities.</li>\n</ul>\n<ul>\n<li>On a daily basis, you'll work on new functionality, and be involved in the decisions made regarding implementation, testing, and backlog prioritization. You will collaborate with the rest of the engineering team through code reviews and participate in making architectural decisions.</li>\n</ul>\n<ul>\n<li>Our teams are organized around Lean Flow, data-informed, and human-centered design with shared mission to build delightful software that solves our customers greatest needs. </li>\n</ul>\n<ul>\n<li>Your team performs engineering support when a question can't be answered by our in-house support team and passes triage. We'll get you up-to-speed with engineering support so you can help our customers and improve the product along the way.</li>\n</ul>\n<ul>\n<li>We are committed to creating and maintaining an excellent customer experience. We expect you to have a keen sense of how your code will impact the experience in terms of performance, security and usability.</li>\n</ul>\n<ul>\n<li>You’ll be working with people that challenge you to grow every day, including leaders in Design and Product. The founders and leadership team are technical and committed to creating a magical experience for our customers. </li>\n</ul>\n<ul>\n<li>You will periodically partner with our Talent team to help us hire our future team members.</li>\n</ul>\n<ul>\n<li>Salary: We have an internal transparent salary matrix for each team. Read more about how we approach compensation <a class=\"postings-link\" href=\"https://www.helpscout.com/blog/employee-compensation/?utm_term=&amp;utm_campaign=Performance_Max&amp;utm_source=adwords&amp;utm_medium=ppc&amp;gclid=Cj0KCQjw--GFBhDeARIsACH_kdaB-QyipOjV7hva70dRuVPMXBqVgOqBf6yH8YpHVBUkVFLCTXy7QWMaAuj5EALw_wcB\" rel=\"nofollow\">here</a>! For this role, we have $129,000 to 156,000 USD slated in the budget</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">About you</div>\n<ul>\n<li>You became an engineer because you like writing software that helps people. Your code is not only a pleasure for customers to use, but for other engineers to read and understand easily.</li>\n</ul>\n<ul>\n<li>You are a great communicator and have an excellent command of written and spoken English. As a remote company, we rely on clear communication for collaboration and execution. </li>\n</ul>\n<ul>\n<li>You are a skilled and passionate engineer who is friendly, collaborative, and supportive.</li>\n</ul>\n<ul>\n<li>You take ownership of your creation seriously and actively participate in each step of the development lifecycle.</li>\n</ul>\n<ul>\n<li>You understand the need to balance business and customer needs with agile delivery of tightly scoped, scalable code that stands the test of time.</li>\n</ul>\n<ul>\n<li>You bring a level of Java-specific expertise that will help us craft an outstanding experience for customers and fellow developers. You enjoy working with the JVM and will be comfortable using or learning Kotlin.</li>\n</ul>\n<ul>\n<li>You are no stranger to build and deployment automation. </li>\n</ul>\n<ul>\n<li>Your typical production readiness checklist covers things like redundancy, resiliency, monitoring, alerting and logging.</li>\n</ul>\n<ul>\n<li>You value giving and receiving feedback just as much as we do. You see it as an opportunity for personal and career growth.</li>\n</ul>\n<ul>\n<li>You consider how your work impacts others and demonstrate thoughtful, flexible approaches to mentoring and guiding technical decisions.</li>\n</ul>\n<ul>\n<li>In order to ensure enough team overlap, you are located anywhere between Mountain Time and Central European Time zones.</li>\n</ul>\n<div><span style=\"font-size: 24px;\">Benefits</span></div>\n<div><strong>Competitive salary</strong> - Our salary formula is public to all employees (but doesn't divulge your specific salary) and we update it at least once per year. Your salary is the same no matter where you live. Our goal is to pay at or above the market rate of a US-based tech hub like Boston or Seattle.</div>\n<div> </div>\n<div><strong>Health and dental insurance</strong> - We cover you and your family's health/dental insurance 100%. If you are based in the US, we'll cover you on our Aetna policy. If you're based outside the US, we'll reimburse your out-of-pocket health and dental insurance costs.</div>\n<div> </div>\n<div><strong>Long-term/short-term disability insurance &amp; life insurance</strong> - we cover 100% of the premiums for LT/ST disability insurance and base life insurance. You also have the option to purchase supplementary life insurance through our provider (currently US only).</div>\n<div> </div>\n<div><strong>Flexible vacation</strong> - Take time off when you need it! We recommend 3-4 weeks in addition to public holidays, but there are no firm rules. We trust you.</div>\n<div> </div>\n<div><strong>Sabbatical</strong> - After you've been at Help Scout for 4 years, you get a month of paid vacation (in addition to regular vacation) and $2,500 to spend towards travel, learning, projects or anything else during your time off. <a class=\"postings-link\" href=\"https://www.helpscout.com/blog/sabbatical-from-work/\" rel=\"nofollow\">Read about what our CEO did.</a></div>\n<div> </div>\n<div><strong>Paid parental leave, including adoption </strong>- 12 weeks of paid leave for all new parents.</div>\n<div> </div>\n<div><strong>401k with 1% match</strong>- via Betterment for Business (currently US only)</div>\n<div> </div>\n<div><strong>Personal Development stipend</strong> - Up to $1,800 per year to improve your craft</div>\n<div> </div>\n<div><strong>Bonuses - </strong>everyone is eligible to receive a quarterly bonus up to 8% based on shared company revenue goals.</div>\n<div> </div>\n<div><strong>Set you up for success</strong> — we’ll get every new teammate a Mac laptop or equivalent of their choice, and provide a $1500 stipend so you can feel ready to work from home. We also cover up to $350 USD per month if you'd like to rent a co-working desk somewhere.</div>\n<div> </div>\n<div><strong>Complete transparency</strong> - Everyone has full access to business metrics and financial information about the company.</div>\n<div> </div>\n<div><span style=\"font-size: 24px;\">About Us</span></div>\n<div><a class=\"postings-link\" href=\"https://www.helpscout.com/\" rel=\"nofollow\">Help Scout</a> is made by roughly 110 people in 80+ cities around the world, all with a passion for helping others. We come from diverse backgrounds and are united by an enthusiasm for great products and delightful customer experiences. Help Scout launched in 2011 and today we have more than 12,000 paying customers in 140+ countries.</div>\n<div> </div>\n<div><span style=\"font-size: 24px;\">Why Help Scout?</span></div>\n<div><strong>We're remote.</strong> It doesn’t matter if you’ve worked remotely before — we’ve been doing it for nearly a decade and are <a class=\"postings-link\" href=\"https://www.helpscout.net/blog/remote-culture/\" rel=\"nofollow\">helping to write the playbook</a> — we’re happy to show you the ropes. Most folks that get a taste of working in a \"remote first\" company have a hard time going back to the old way of doing things.</div>\n<div> </div>\n<div><strong>We’re passionate about diversity and inclusion.</strong> The data is abundantly clear about diverse teams being more successful, and we're dedicated to setting the team up for success. Today our leadership team is 62% women, and that's just the start. Here's our <a class=\"postings-link\" href=\"https://www.helpscout.com/dei/\" rel=\"nofollow\">DEI Dashboard</a> where you can see all of our team demographic data and read about our commitment to this work.</div>\n<div> </div>\n<div><strong>We're committed to SMBs for the long term.</strong> Help Scout is focused entirely on serving small and midsize businesses, typically up to 500 employees, because those companies view customer service differently. It's not a cost to be optimized, it's their most effective marketing tool and a key differentiator from the competition. We built Help Scout for companies that truly <em>value</em> being customer-centric (like us) and want a product that shares their values.</div>\n<div> </div>\n<div><strong>We're leaving the world better than we found it.</strong> Did you know Help Scout is a certified B Corporation, with a mission to give away at least 1% of our product through <a class=\"postings-link\" href=\"https://www.helpscout.com/for-good/\" rel=\"nofollow\">Help Scout for Good</a>? Our company exists not just to help ourselves, but to invest in our team, our customers, our community, and our environment.</div>\n<div> </div>\n<div><span style=\"font-size: 24px;\">Our commitment to you</span></div>\n<div>We are an equal opportunity employer and are committed to building a company that embraces and celebrates <a class=\"postings-link\" href=\"https://www.helpscout.com/blog/diversity-inclusion-2019/\" rel=\"nofollow\">diversity and inclusion</a>. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status. We have read the studies and understand that diverse teams build better products, bring more perspective to the table, contribute to a company’s financial success and help foster a more inclusive environment for all employees, but the bottom line is that it's the right thing to do.</div>\n<p><br><br></p>\n",
			"company_logo_url": "https://remotive.io/job/737492/logo"
		},
		{
			"id": 921962,
			"url": "https://remotive.io/remote-jobs/software-dev/lead-software-engineer-921962",
			"title": "Lead Software Engineer",
			"company_name": "Fleetio",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-17T21:46:17",
			"candidate_required_location": "USA, Canada, and Mexico",
			"salary": "",
			"description": "<p><a class=\"external\" href=\"http://fleetio.com/\" rel=\"nofollow\">Fleetio</a> is a modern software platform that helps thousands of organizations around the world manage a fleet. Transportation technology is a hot market and we’re leading the charge, with raving fans and new customers signing up every day. <a class=\"external\" href=\"https://bhamnow.com/2020/11/10/birmingham-based-company-fleetio-raises-21-million-in-funding/\" rel=\"nofollow\">We recently raised a $21M Series B round</a> and are on an exciting trajectory as a company.</p>\n<p>We are looking for a product-minded, hands-on <strong>Software Engineering</strong> <strong>Leader</strong> with a strong passion and experience leading people. This is a hybrid role that offers a good balance between hands-on contribution and leadership. The ideal candidate is someone who has the ability to lead a small team of engineers to achieve product delivery goals and help them grow their careers.</p>\n<p>In this role, you will have the opportunity to stay hands-on while following your passion to be a people leader. You will wear multiple hats depending on the situation such as - <strong><em>engineer</em></strong>, <strong><em>leader</em></strong>, <strong><em>coach</em></strong>, <strong><em>mentor</em></strong>. This role is hugely impactful in helping shape Fleetio's engineering culture and individual careers. So, if you like making a positive impact on people and building great products, this is the role for you!</p>\n<p><strong>More about Fleetio</strong></p>\n<ul>\n<li>Fleetio overview video: <a class=\"external\" href=\"https://www.youtube.com/watch?v=IlvIbwZT3oU\" rel=\"nofollow\">https://www.youtube.com/watch?v=IlvIbwZT3oU</a></li>\n<li>More about the Fleetio platform: <a class=\"external\" href=\"https://www.fleetio.com/features\" rel=\"nofollow\">https://www.fleetio.com/features</a></li>\n<li>API docs: <a class=\"external\" href=\"https://developer.fleetio.com/\" rel=\"nofollow\">developer.fleetio.com</a></li>\n<li>Test drive Fleetio to get an even better feel for what we're building: <a class=\"external\" href=\"https://www.fleetio.com/register\" rel=\"nofollow\">https://www.fleetio.com/register</a></li>\n</ul>\n<p><em><strong>This is a remote role and is open to candidates based in the United States, Canada, or Mexico</strong>.</em></p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">What you'll be doing</div>\n<ul>\n<li>You’ll work closely with Product Managers, Designers, and other leaders to ensure your team has clear goals and direction.</li>\n<li>You will maintain a healthy culture within the team, that is in line with <a class=\"external\" href=\"https://www.fleetio.com/careers#values\" rel=\"nofollow\">company values</a> and our <a class=\"external\" href=\"https://www.fleetio.com/careers/engineering#philosophy\" rel=\"nofollow\">engineering philosophies</a>.</li>\n<li>You will collaboratively design and architect features, refactor as necessary and write elegant and performant code.</li>\n<li>You will also conduct weekly 1-on-1's with your direct reports to ensure good morale and address any needs.</li>\n<li>You will participate in team meetings as necessary (business and technical). We place great emphasis on NOT conducting ineffective, unnecessary meetings and are an advocate for focus times. At the same time, we expect our leaders to attend, participate in team meetings that we believe are important for the flow of information that will help them (as a leader) provide timely context to your team.</li>\n<li>You will help with recruiting efforts by participating in the hiring manager screen, leading team interviews, and ensuring the team provides meaningful feedback.</li>\n<li>You’ll have a strong voice in the development and planning processes, so senior-level experience is key.</li>\n</ul>\n<div class=\"h3\"> </div>\n<div class=\"h3\">What's in it for you</div>\n<ul>\n<li>Be a part of an incredible team of “A” players who go above and beyond to make Fleetio a successful company. You will build software used by people all around the world. So many different types of companies and organizations operate a fleet each day, and Fleetio is a good fit for most of them (it’s a huge market).</li>\n<li>Work remotely (within the United States, Canada or Mexico), or at our Birmingham, AL HQ. Over 80% of our Engineering Team works remotely (including our CTO), and we have promoted a strong remote working culture since the beginning (2012).</li>\n<li>We place great emphasis on work/life balance. We have families and hobbies and know you do, too.</li>\n</ul>\n<div class=\"h3\"> </div>\n<div class=\"h3\">Our team</div>\n<p>Our Engineering and Product teams are structured as autonomous squads that execute within one focal area toward a defined product vision. We're hardcore believers in easy-to-use software and our main goal as Product Engineers is to quickly and continuously deliver meaningful value to our customers. We've optimized our CI/CD tools and processes to get code into our production environments easily, resulting in an average of 40 deploys per week.</p>\n<ul>\n<li>Check out our Engineering culture page: <a class=\"external\" href=\"https://www.fleetio.com/careers/engineering\" rel=\"nofollow\">https://www.fleetio.com/careers/engineering</a></li>\n<li>Watch our culture videos: <a class=\"external\" href=\"https://fleet.io/culture\" rel=\"nofollow\">https://fleet.io/culture</a></li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Proven experience leading a software engineering team</li>\n<li>Strong track record leading engineering team(s) to consistently deliver quality software</li>\n<li>History of exercising sound judgment and decision-making</li>\n<li>Strong passion and experience in coaching, mentoring engineers</li>\n<li>Ability to bring people together and create an environment that breeds trust and respect for each other.</li>\n<li>Proven full-stack development experience with Ruby on Rails, React (or similar front ends libraries/frameworks), Postgres</li>\n<li>Experience solving challenging architecture problems with good design</li>\n<li>Excellent communication skills (particularly written)</li>\n<li>Be sure to mention \"coffee\" in your application so we know you read this</li>\n</ul>\n<div class=\"h3\"> </div>\n<div class=\"h3\">Considered a plus</div>\n<ul>\n<li>Experience with ReactJS, TypeScript</li>\n<li>Experience with Tailwind or CSS-in-JS frameworks</li>\n<li>You know a thing or two about the Fleet industry</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>100% coverage of employee health and dental insurance (50% family)</li>\n<li>401(k) + match</li>\n<li>Company stock options</li>\n<li>Vision, STD &amp; LTD</li>\n<li>Dependent Care FSA and Medical FSA</li>\n<li>Generous PTO, Company Holidays &amp; Floating Holiday</li>\n<li>Maternity/Paternity leave</li>\n<li>Community service funds</li>\n<li>Mac laptop</li>\n<li>Professional development funds</li>\n<li>Health and wellness incentives</li>\n<li>Remote working friendly since 2012 #LI-REMOTE</li>\n</ul>\n<p><strong>Not quite what you were hoping for? Check out our other engineering roles <a class=\"external\" href=\"https://www.fleetio.com/careers/engineering#jobs\" rel=\"nofollow\">here</a>.</strong></p>\n<p><em>For Non-U.S. based candidates, Fleetio offers a country-specific competitive benefits package.</em></p>\n<p><em>Fleetio provides equal employment opportunities to all employees and applicants and prohibits discrimination and harassment. We celebrate diversity and are committed to creating an inclusive environment for all. All employment is decided on the basis of qualifications, merit and business need.</em></p>\n<p><em>This application is not intended to and does not create a contract or offer of employment. Employment with Fleetio is at will.</em></p>\n<p><em>If you have a disability or a special need that requires an accommodation to fill out the online application, please let us know by calling (205) 718-7500 or emailing <a class=\"external\" href=\"mailto:recruiting@fleetio.com\" rel=\"nofollow\">recruiting@fleetio.com</a></em>.</p>\n"
		},
		{
			"id": 920806,
			"url": "https://remotive.io/remote-jobs/software-dev/senior-backend-developer-920806",
			"title": "Senior Backend Developer",
			"company_name": "valiu",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-17T21:46:14",
			"candidate_required_location": "Anywhere",
			"salary": "",
			"description": "<div class=\"h2\"><strong>About Valiu</strong></div>\n<p style=\"min-height: 1.5em;\"><em>Hey, we are glad you are interested in Valiu! 🚀</em></p>\n<p style=\"min-height: 1.5em;\">We are making it easy for people in Latin America to earn, save and spend with crypto. Valiu's infrastructure is designed to support the transition from fiat to crypto, for everyone. We are focused on Latin America's emerging economies, starting with Venezuela. We’re enabling the first crypto economy in Venezuela, and aim to follow with other LatAm economies thereafter.</p>\n<p style=\"min-height: 1.5em;\">We aim to increase economic freedom for people and businesses living under hyperinflation so that they can acquire, hold, pay and earn in a stable asset. We are now pursuing this by offering crypto-enabled products to end consumers, while abstracting all crypto-related complexities. </p>\n<p style=\"min-height: 1.5em;\">We are pragmatic first, and we are playing the long game. We process payments, custody crypto, detect fraud, build on blockchain, design world-class APIs, and more. Every request we process is very important to everyone involved and Valiu’s availability and reliability are critical to ensure and promote trust in our platform.</p>\n<p style=\"min-height: 1.5em;\"><em>Valiu is now officially remote. We have team members across Latin America, the US, Europe and Africa.</em></p>\n<div class=\"h2\"><br><strong>Opportunity Overview</strong></div>\n<p style=\"min-height: 1.5em;\">As Senior Backend Developer, your mission is to develop and maintain our core backend, which handles several types of financial operations, calculates money exchange rates and does Valiu's treasury operations. This involves maintaining and developing integrations with third party providers, writing unit tests to ensure the quality of the code, and documenting your work so that other people can easily understand it.</p>\n<p style=\"min-height: 1.5em;\">You will report and work with other backend developers, data scientists and infrastructure developers.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Qualities of an Ideal Candidate</strong></div>\n<p style=\"min-height: 1.5em;\">Below are some guidelines that we believe an ideal candidate would have. Above all, we're doing bold new things, and as such we prioritize seeking people that want to grow, learn and better themselves every day. This is more important to us than having any specific skill or experience.</p>\n<p style=\"min-height: 1.5em;\"><u><em>The easy stuff</em></u></p>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">You can plan, organize, schedule and budget in an efficient productive manner. You focus on key priorities.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\"> You move quickly and take a forceful stand without being overly abrasive.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">You are able to structure and process qualitative or quantitative data and draw insightful conclusions from it.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">You act without being told what to do and bring ideas to the company. You demonstrate tenacity and willingness to get sh*t done.</p>\n</li>\n</ul>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">You are able to see and communicate the big picture in an inspiring way. You determine opportunities and threats through comprehensive analysis of current and future trends.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">5+ years of experience working on backend systems and REST APIs.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Experience working with PostgreSQL and/or MongoDB.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Proficient in English.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><u><em>Nice to have</em></u></p>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">Fluency in Typescript</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Experience working with large financial distributed systems.</p>\n</li>\n</ul>\n<div class=\"h2\"><strong>Perks at Valiu</strong></div>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">Remote team, work from anywhere in the world.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Competitive compensation (including stock options).</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Remote health insurance.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Exercise monthly bonus, spend as you will on exercise stuff.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Education monthly bonus, spend as you will on education stuff.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Access to Reforge growth programs.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Compensation in USD or Bitcoin.</p>\n</li>\n</ul>\n"
		},
		{
			"id": 908725,
			"url": "https://remotive.io/remote-jobs/software-dev/react-native-engineer-908725",
			"title": "React Native Engineer",
			"company_name": "ProDev",
			"category": "Software Development",
			"tags": [],
			"job_type": "contract",
			"publication_date": "2021-10-17T21:46:10",
			"candidate_required_location": "USA Only",
			"salary": "",
			"description": "<p>ProDev is looking for a US-based React Native engineer!</p>\n<p>We're working on building a greenfield React Native application for one of our clients! You'll be working closely with key stakeholders at our client, and a team at ProDev to deliver a beautiful application that delights. We focus on shipping frequently, collaborating closely with our client to incorporate their feedback on an ongoing basis. You'll work closely with other senior-level US-based pros. </p>\n<div class=\"h1\">About you</div>\n<ul><li>Enjoy working remotely.</li><li>Happy working as a freelance contractor.</li><li>Ability to work on your own with minimal supervision.</li><li>Authorized to work in the United States.</li><li>Strong communicator - being 100% remote, excellent communication is critical for what we do.</li><li>You love to ship - you're focused on delivering value and you are biased towards action.</li></ul>\n<div class=\"h1\">Requirements</div>\n<ul><li>Deep experience building robust and performant React Native applications on iOS and Android</li><li>Deep experience writing performant and maintainable Javascript</li><li>You're comfortable working across the full lifecycle of application development - you're comfortable setting up a strong foundation,  deploying applications throughout the lifecycle, shepherding applications through the app store review process, and monitoring applications to maintain high standards.</li><li>You have experience shipping live applications to Google Play and/or Apple app stores</li><li>You're very comfortable balancing priorities - you have great instincts for where to invest extra time in testing, and the order of operations for how ship full applications. When you're unclear, you know what questions to ask and you ask them.</li></ul>\n<div class=\"h1\">Bonus Points</div>\n<ul><li>Experience working with in-app purchases for Google Play and/or Apple</li><li>Experience with Docusign or similiar SDK integrations</li></ul>\n<div class=\"h1\">About ProDev</div>\n<p>ProDev partners with incredible freelance developers from across North America to build products that delight. Our clients look to use them to provide exceptionally talented consultants who can help them accelerate their delivery. Our team has been specializing in remote-based software consulting for over 12 years. Our goal is to build an exceptionally talented group of technologists who enjoy shipping high-quality code, working together, and are committed to continuous learning.<br></p>\n<p><br><br></p>\n"
		},
		{
			"id": 919966,
			"url": "https://remotive.io/remote-jobs/software-dev/full-stack-engineer-customer-facing-919966",
			"title": "Full Stack Engineer - Customer Facing",
			"company_name": "navattic",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-17T21:46:06",
			"candidate_required_location": "USA Only",
			"salary": "",
			"description": "<p style=\"min-height: 1.5em;\">As the full-stack client facing engineer, you will be responsible for setting the standard for future employees and a primary interface with our growing customer base. You'll join our lean engineering team in wearing many hats and working on all parts of our tech stack. We care deeply about helping our customers be successful and enabling them to build the best possible product experiences using the Navattic demo creation platform.</p>\n<p style=\"min-height: 1.5em;\">Core responsibilities will be supporting our customers at different stages of their Navattic journey by working directly with users to provide answers to product questions, sharing best practices, and debugging technical issues.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">🏠 <strong>Location</strong>: Remote/San Francisco - Some of our team members are remote and others are based in San Francisco. Both options are available for this role!</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\">Personal traits we are looking for:</div>\n<ul>\n<li>Has deep empathy for the end user and excited to talk to customers to reach a deep understanding of the problem.</li>\n<li>Are naturally curious and willing to pick up new skills.</li>\n<li>Gets excited about solving interesting problems.</li>\n<li>Is resourceful and resilient when faced with ambiguity and new challenges.</li>\n<li>Able to take customer requests and feedback and turn them into technical requirements for our product roadmap.</li>\n<li>Can verbalize several proposed solutions for a given problem. Earnest to collaborate, but defaults to action and can autonomously figure out the solution to a problem.</li>\n<li>Is opinionated, but enjoys the benefits of being a generalist and not tied down to a specific language, framework, or part of our codebase.</li>\n<li> </li>\n</ul>\n<div class=\"h2\">Experience we're looking for:</div>\n<ul>\n<li>Typescript / JS / React / Node</li>\n<li>Developing efficient, extensible JS libraries</li>\n<li>Patience in communication and teaching - you love to enable others and see them succeed</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\">What you can expect:</div>\n<p style=\"min-height: 1.5em;\"><strong>1. An intro call</strong> with the founders so we can learn about each other. We're most interested in learning why you were motivated to apply.</p>\n<p style=\"min-height: 1.5em;\"><strong>2. A small task</strong> to complete similar to a problem you would encounter as a member of the team.</p>\n<p style=\"min-height: 1.5em;\"><strong>3. Another call to present your work.</strong> You can expect a few more technical questions so we get an understanding of how you think.</p>\n"
		},
		{
			"id": 919967,
			"url": "https://remotive.io/remote-jobs/software-dev/principal-software-engineer-python-apis-919967",
			"title": "Principal Software Engineer (Python/APIs)",
			"company_name": "belvo",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-17T21:46:02",
			"candidate_required_location": "CEST timezone",
			"salary": "",
			"description": "<p style=\"min-height: 1.5em;\"><strong>A little bit about us:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">We are Belvo, a financial API platform with the bold vision of democratizing access to financial services in Latin America. We enable any company or developer to access and interpret their end-users’ financial information. We are turning the rich and diverse Latin American financial ecosystem into a set of developer-friendly tools and APIs.<br><br></p>\n<p style=\"min-height: 1.5em;\">We’re a highly-technical, passionate and driven team. We are currently 70 people, projected to be 100+ by the end of 2021. Our team currently represents 15 nationalities and we have offices in Barcelona, Mexico City, and São Paulo - while a large portion of us works remotely.<br><br></p>\n<p style=\"min-height: 1.5em;\">We are tackling a very challenging problem: connecting fintech innovators with legacy financial infrastructure. We strive to go beyond the limits of what is possible today and to do so in an elegant and developer-first way.</p>\n<p style=\"min-height: 1.5em;\"><br>Since starting our adventure in May 2019, we have raised $56m from the leading VC investors globally.<br><br></p>\n<p style=\"min-height: 1.5em;\">You can read more about us and why we’re doing what we’re doing <a href=\"https://techcrunch.com/2020/02/18/meet-belvo-a-yc-backed-startup-building-a-financial-api-for-latin-america/\" rel=\"nofollow\">here</a> and <a href=\"https://belvo.com/blog/belvo-turning-two-years-old/\" rel=\"nofollow\">here</a>.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>About the team:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul>\n<li>We work in cross-functional, autonomous teams. We follow continuous delivery best practices executed on top of a modern technology stack. </li>\n<li>Our products are built for developers, by developers. Technological excellence is at the heart of what we do.</li>\n<li>We are pragmatic and customer focused. We strive to find the right set of trade-offs in order to validate our hypothesis as early as possible, iterating on our products based on customer feedback. </li>\n<li>We communicate transparently. We do weekly all hands where we get together to discuss company performance and goals.</li>\n<li>We are a flexible international team focused on creating cool stuff. Some of us prefer to work together in one of our offices and others prefer remote. For us there's no difference as long as you have an excellent internet connection and are able to overlap with the team between 3pm and 6pm, CEST timezone. </li>\n<li>Also we are backed by some of the leading investors in Silicon Valley and Latin America, including Founders Fund, Kaszek Ventures and YCombinator<br><br></li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>Your challenge:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">Lead the architecture, design and implementation of Backend services and APIs powering Belvo FinTech infrastructure.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Coordinate technical execution with other team members. Envision solutions collaboratively and coordinate their execution as a team, addressing technical and coordination issues.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Mentor other engineers and be a force multiplier.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Build excellent documentation, SDKs, client libraries. Continuously improve the “developer experience” of Belvo’s platform</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Be customer-focused, think as a user of our APIs. Proactively tackle potential improvements and customer pain points.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Carefully manage API retro compatibility, document API changes and implement deprecation plans</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Implement automated quality assurance and monitoring modules<br><br></p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>You can be part of the gang if:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul>\n<li>8+ years of experience as a Software Engineer, of which 2+ as a Principal Engineer / Tech Lead</li>\n<li>\n<p style=\"min-height: 1.5em;\">Strong experience designing and developing RESTful APIs</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Strong professional experience with Python and Django.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Willingness to solve challenging problems</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Empathy, a collaborative spirit, and the ability to work effectively with a team.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">You appreciate good documentation, internal and external.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Attention to detail, especially around performance, reliability, and security.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Excellent spoken and written English</p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>Amazing if:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">Fintech and SaaS past experience</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Relevant programming knowledge in other languages such as Javascript, Java, PHP, Ruby or Go</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Experience building large-scale platforms with a global reach</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Our tech stack:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul>\n<li>We’re building our platform using modern technologies, putting the focus on reliability and long-term maintainability</li>\n<li>We primarily use Python on the backend. We use battle-tested technologies such as Django, and we are heavy users of Python’s asyncio for some parts of our stack</li>\n<li>We use Javascript, Vue.js and Sass on the frontend. We are developing and leveraging our own design system and component library</li>\n<li>We run our infrastructure on top of Amazon Web Services, leveraging managed services. We tend to favor the use of managed services wherever possible, in order to focus on our business problems</li>\n<li>We observe and monitor our services using Datadog</li>\n<li>We follow Continuous Integration and Continuous Delivery best practices<br><br></li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>Our perks:</strong><br><br>🚀 Stock options (we are all owners and this is very important to us)</p>\n<p style=\"min-height: 1.5em;\">🔆 Flexible working hours</p>\n<p style=\"min-height: 1.5em;\">🔝 Remote friendly</p>\n<p style=\"min-height: 1.5em;\">🐶 Pet friendly</p>\n<p style=\"min-height: 1.5em;\">🧘🏾‍♀️ Access to mental health service</p>\n<p style=\"min-height: 1.5em;\">👩🏻‍⚕️ Health Insurance</p>\n<p style=\"min-height: 1.5em;\">🎊 Paid time off on your birthday</p>\n<p style=\"min-height: 1.5em;\">🌎 Work from any office twice per year</p>\n<p style=\"min-height: 1.5em;\">💻 Renew your laptop every 2 years</p>\n<p style=\"min-height: 1.5em;\">🙋 Training Budget</p>\n<p style=\"min-height: 1.5em;\">😎 Team building events</p>\n<p style=\"min-height: 1.5em;\">🙀 Bank holidays swap inside the same month</p>\n<p style=\"min-height: 1.5em;\">🔋 Fitness/ wellness stipends</p>\n<p style=\"min-height: 1.5em;\">🚀 Yearly offsite</p>\n<p style=\"min-height: 1.5em;\">🍒 Fresh fruit every week, all-you-can-drink tea and coffee</p>\n<p style=\"min-height: 1.5em;\">🍻 Friday happy hours after our weekly team meetings</p>\n"
		},
		{
			"id": 919965,
			"url": "https://remotive.io/remote-jobs/software-dev/full-stack-engineer-919965",
			"title": "Full-Stack Engineer",
			"company_name": "navattic",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-10-17T17:41:12",
			"candidate_required_location": "USA Only",
			"salary": "",
			"description": "<p style=\"min-height: 1.5em;\">As the full-stack engineer, you will be responsible for setting the standard for future employees and the cadence of product development. You'll join our lean engineering team in wearing many hats and working on all parts of our tech stack.</p>\n<p style=\"min-height: 1.5em;\">Core responsibilities will be building out new features requested by our customers, developing extensible JS libraries, and brainstorming creative solutions to challenging problems.</p>\n<p style=\"min-height: 1.5em;\">🏠 <strong>Location</strong>: Remote/San Francisco - Some of our team members are remote and others are based in San Francisco. Both options are available for this role!</p>\n<div class=\"h2\">Personal traits we are looking for:</div>\n<ul>\n<li>Are naturally curious and willing to pick up new skills.</li>\n<li>Gets excited about solving interesting problems.</li>\n<li>Has deep empathy for the end user and willing to talk to customers to reach a deep understanding of the problem.</li>\n<li>Can verbalize several proposed solutions for a given problem. Earnest to collaborate, but defaults to action and can autonomously figure out the solution to a problem.</li>\n<li>Is opinionated, but enjoys the benefits of being a generalist and not tied down to a specific language, framework, or part of our codebase.</li>\n</ul>\n<div class=\"h2\">Experience we're looking for:</div>\n<ul>\n<li>Typescript / JS / React / Node</li>\n<li>Developing efficient, extensible JS libraries</li>\n<li>Bonus: Experience building enterprise-grade applications</li>\n</ul>\n<div class=\"h2\">What you can expect:</div>\n<p style=\"min-height: 1.5em;\"><strong>1. An intro call</strong> with the founders so we can learn about each other. We're most interested in learning why you were motivated to apply.</p>\n<p style=\"min-height: 1.5em;\"><strong>2. A small task</strong> to complete similar to a problem you would encounter as a member of the team.</p>\n<p style=\"min-height: 1.5em;\"><strong>3. Another call to present your work.</strong> You can expect a few more technical questions so we get an understanding of how you think.</p>\n"
		},
		{
			"id": 685107,
			"url": "https://remotive.io/remote-jobs/software-dev/expert-backend-engineer-685107",
			"title": "Expert Backend Engineer",
			"company_name": "BackMarket",
			"category": "Software Development",
			"tags": [],
			"job_type": "contract",
			"publication_date": "2021-10-16T21:07:49",
			"candidate_required_location": "UK, Germany, France, & the Netherlands",
			"salary": "",
			"description": "<div class=\"h3\">Who we are: </div>\n<div>Founded in 2014, <strong>BackMarket</strong> is the first online marketplace dedicated exclusively to refurbished electronic devices. With 434M€ raised already, we are sabotaging ‘new’ by connecting highly selected certified professionals to consumers who are looking for a more affordable, reliable, and ecological alternative to purchasing brand new products.</div>\n<div> </div>\n<div>Leading the way in a shift towards a circular economy, freeing the planet from electronic waste, and building a global leading tech company are three solid reasons to wake up every morning. Taking part in BackMarket’s adventure means committing to an ambitious project with a strong social and environmental impact.</div>\n<div> </div>\n<div>We are committed to providing an inclusive, fulfilling, and caring work environment in all our offices (Paris, Bordeaux, New York, Berlin, Barcelona). This is an opportunity for you to join a talented, humble, and passionate team at the heart of innovation: our Bureau Of Technology.</div>\n<div> </div>\n<div><span id=\"m_-3810160234597051270gmail-docs-internal-guid-d8e5a12f-7fff-f740-fc86-2e5840e35e36\">Our roles are 100% remote-friendly in the UK, Germany, France, and the Netherlands. If you are from elsewhere but willing to move to one of our countries, let’s talk about it 💪</span></div>\n<div> </div>\n<div class=\"h3\">About the job:</div>\n<div>We are looking for a Senior Backend Engineer who will help to design, develop, and manage the technical functionalities related to the evolution and adaptation of our international business. <br><br>You will be working in an agile \"build it and run it\" environment where engineering teams build, launch, monitor, and support the product that they own. <br><br>We are looking for passion in creating systems by producing clean, consistent, and well-organized code. As well as a good team player supporting colleagues and creating a learning and sharing environment!<br><br>The Tech team is growing as fast as the business, and we are looking for people to join us in multiple teams. Whether it will be on the management of customers and suppliers payments (Bucks), our after-sales and quality services (Customer Satisfaction), our merchant back-office tooling and interface, or just new teams for brand new products, the choice is yours!</div>\n<div> </div>\n<div class=\"h3\">What you will bring to the team:</div>\n<ul>\n<li>At least 5 years of experience as a talented developer.</li>\n<li>Love in distributed, high-volume services in Python (or any language) and good knowledge in shipping high-quality code (clean code, TDD, BDD, DDD, SOLID).</li>\n<li>Curiosity, proactivity, team spirit, and passion.</li>\n<li>Scrum and Kanban are not karate moves and you hate the V cycle.</li>\n<li>Great verbal and written communication skills, in English at least, French is a plus.</li>\n<li>Interest in our tech stack: AWS, Kubernetes, Docker, RestFul API, Python, VueJs, Nuxt, Algolia, Datadog, Spinnaker, SQS, ElasticSearch, Nginx, UWSGI.</li>\n<li>Beginner chess players accepted. We also take those who prefer board games and musicians (we have a band!).</li>\n</ul>\n<div class=\"h3\">Why should you join us:</div>\n<ul>\n<li>A meaningful job: through hard work, you will help avoid thousands of tons of electronic waste and fight against planned obsolescence. It counts!</li>\n<li>An attractive salary, equity, multiple benefits (meal tickets, health insurance, etc...), parental benefits, remote-friendly, relocation package, internal events, etc…</li>\n<li>Technical challenges all day every day: you will have the freedom to innovate and adopt new ideas!</li>\n<li>Work with passionate experts who will share their knowledge and help you develop and grow! (Backademy, technical guilds, Meet-up &amp; Conference)</li>\n<li>Grow your career with a flexible career path, BackMarket can help you evolve!</li>\n<li>A booming scale-up: our environment is rapidly growing in Europe, the USA, and now in Asia!</li>\n<li>A lot of fun: you will have the opportunity to work in a fast-paced, open-minded, and friendly environment.</li>\n</ul>\n<p>BackMarket is an Equal Opportunity Employer for any minority, disability, gender identity or sexual orientation.</p>\n",
			"company_logo_url": "https://remotive.io/job/685107/logo"
		},
		{
			"id": 798256,
			"url": "https://remotive.io/remote-jobs/software-dev/senior-software-engineer-798256",
			"title": "Senior Software Engineer",
			"company_name": "Partly",
			"category": "Software Development",
			"tags": [],
			"job_type": "full_time",
			"publication_date": "2021-07-23T01:39:25",
			"candidate_required_location": "New Zealand",
			"salary": "",
			"description": "<p><em><u>Note: you must have the legal right to live and work in New Zealand in order to be considered for this role</u>. If relocating to Christchurch, we can assist with moving and setup costs.</em></p>\n<div class=\"h2\">About us</div>\n<p>Partly is an early-stage startup on a mission to connect the world's parts. There is currently a huge, mostly unsolved problem within the industry - linking a part to the vehicles it fits (often hundreds) is incredibly time consuming, often impossible. This is the problem we're solving, and involves structuring millions of vehicles, hundreds of millions of parts, and billions of links. We use a number of bleeding edge technologies to do this (dGraph graph database, Kafka event streaming, etc).</p>\n<p>We were founded by ex-Rocket Lab engineers and raised our Seed round from Blackbird Ventures (Canva, CultureAmp etc.), Hillfarrance, IceHouse Ventures and Peter Beck (RocketLab Founder).</p>\n<p>We have 2 main products: <a href=\"https://www.partly.com/software/partspal\" rel=\"nofollow\">PartsPal</a>, a SaaS tool that makes it easy for parts businesses to sell online; and <a href=\"https://www.partly.com/software/partlyapi\" rel=\"nofollow\">Partly API</a>, which larger parts businesses and developers use to structure their data and get online. This is a $1.9 trillion industry, and solving this problem makes a huge difference for our customers. </p>\n<p>The team at Partly are young and ambitious, and continually striving to improve. We are expanding globally, and offering you an exciting opportunity to grow your career alongside us, develop your skills and have fun doing it.</p>\n<p> </p>\n<div class=\"h1\">About the role</div>\n<p>In this role, you will work alongside other members of our development team to tackle hard, exciting problems and build beautiful software.​</p>\n<div class=\"h1\">Qualifications &amp; experience</div>\n<ul>\n<li>Significant experience with large complex datasets</li>\n<li>Experience with Node.JS, Typescript, ORMs such as Prisma or Sequelize</li>\n<li>Experience with React, Angular or Vue</li>\n<li>Experience working with large complex datasets</li>\n<li>At least 3 years experience as a mid to senior developer</li>\n<li>Bonus: Experience with automotive fitment</li>\n<li>Bonus: Experience with DevOps</li>\n<li>Bonus: Experience with GraphQL</li>\n<li>Bonus: Experience creating external integrations (Shopify APIs, Xero, eBay, etc)</li>\n<li>Bonus: Be based (or willing to move) to Christchurch</li>\n</ul>\n<div class=\"h2\">Tasks &amp; responsibilities</div>\n<ul>\n<li>Managing software backend development</li>\n<li>Work in our development team to make beautiful software</li>\n</ul>\n<div class=\"h2\">Benefits</div>\n<ul>\n<li>Salary</li>\n<li>Stock options (at Pre-Seed exercise price)</li>\n<li>Flexible work hours</li>\n<li>Team social events</li>\n<li>Brand new office</li>\n<li>Free snacks and coffee machine</li>\n</ul>\n"
		}
	]
}